{
  "trending_posts": [
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "I analyzed 120,554 insider trades since 2009 to see if stocks outperform when insiders buy the dip. Here are the results!",
      "content": "I analyzed 120,554 insider trades since 2009 to see if stocks outperform when insiders buy the dip. Here are the results!\n\n*edit - a much requested TL;DR -&gt; insiders buying dips outperforms S&amp;P\n\n——\n\nThere is quite a lot of research on insider buying that has found that 1) insiders are mostly value investors who buy the stock when the price is low / the company is undervalued and 2) that insider purchases outperform.\n\nMost of the research is pre-2008 and not exclusively looking at dip buys. I wanted to look at the performance of insider dip buys post-2008.\n\n**Academic research:**\n\nSeyhun wrote a few papers + a book called “Investment Intelligence from Insider Trading” in the 90s that found that insiders are contrarian investors (buy low, sell high) and that insiders outperform. He also found that aggregate insider trading data is able to predict future stock market performance.\n\nLakonishok &amp; Lee (2001), “Are Insider Trades Informative?” reaffirmed these findings and found that insider purchases outperform even after controlling for valuation ([link](https://www.lsvasset.com/pdf/research-papers/Insider-Trades-Informative.pdf))\n\nJenter (2003), “Market Timing and Managerial Portfolio Decisions” found that insiders buy when they believe the market is fundamentally undervaluing the company ([link](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=289159))\n\nLasfer (2024) - \"Corporate insiders' exploitation of investors' anchoring bias at the 52-week high and low\" found that insiders do significantly more buying at 52-week lows and way more selling at 52-week highs, but their purchases at both the 52-week high and low significantly outperform ([link](https://onlinelibrary.wiley.com/doi/epdf/10.1111/fire.12371))\n\n**Where is the data from**\n\nI pulled and cleaned Form 4 data back to 2009 and then paid S&amp;P a ton of money for access to their pricing/company data.\n\n**Data overview:**\n\nI looked at short-term dip buys (previous 1m stock returns) and long-term dip buys (previous 1y stock returns) by insiders. An insider is either an executive, director, or 10% Owner of the company (typically a fund of some kind).\n\nWe also automatically remove all scheduled and \"low signal\" insider trades from all analysis we do (unless otherwise noted). This includes things like: super small trades (&lt;$5k), 10b5-1 plans, Employee Stock Purchase Plans, Dividend Reinvestments, tax sales, Private Placements, Public Offerings, late filings, etc.\n\nAs you can see in the table below, there have been many dip buys since 2009. There have been over 120,000 insider purchases, and over half of them are insiders buying stocks when they have negative previous 1m/1y returns.\n\n|criteria|num\\_insider\\_purchases|\n|:-|:-|\n|all insider purchases|120,554|\n|prev 1m &lt; 0%|69,762|\n|prev 1m &lt; -10%|33,340|\n|prev 1m &lt; -20%|16,020|\n|prev 1m &lt; -30%|7,793|\n|prev 1y &lt; 0%|67,626|\n|prev 1y &lt; -10%|54,009|\n|prev 1y &lt; -30%|30,542|\n|prev 1y &lt; -50%|14,858|\n|prev 1y &lt; -70%|5,144|\n\n**Results:**\n\nAs expected, insider dip buys perform very well (and the returns improve as the dips get larger). The outperformance is also in line with some of the academic research. For example, the Lasfer paper found that insiders buying at the 52-week low outperformed by almost 10%, which lines up with the outperformance we see for dip buys when the previous 1m returns are between -10% and -20% and when previous 1y returns are near -30%.\n\nOne other note is that the \"S&amp;P\" criteria column is the average S&amp;P return from the same date the insider purchases are made.  You'll notice that the average S&amp;P returns are higher than the overall average S&amp;P returns since 2009 (17.3% v \\~15% 1y returns). This matches with another finding from the research: increased insider buying occurs during market dips and also correlates with overall market outperformance.\n\n|criteria|avg\\_3m\\_return|avg\\_1y\\_return|\n|:-|:-|:-|\n|S&amp;P|4.9%|17.3%|\n|prev 1m &lt; 0%|6.3%|17.8%|\n|prev 1m &lt; -10%|8.8%|23.8%|\n|prev 1m &lt; -20%|13.0%|34.5%|\n|prev 1m &lt; -30%|19.5%|52.2%|\n|prev 1y &lt; 0%|7.3%|21.0%|\n|prev 1y &lt; -10%|8.2%|22.6%|\n|prev 1y &lt; -30%|10.7%|28.3%|\n|prev 1y &lt; -50%|14.5%|35.5%|\n|prev 1y &lt; -70%|21.2%|47.4%|\n\nhttps://preview.redd.it/vc3z7xlx7n3g1.png?width=891&amp;format=png&amp;auto=webp&amp;s=3b8927c30d672579f5ec17dcdf96ad691764b733\n\nFor the rest of the analysis, I'm just going to show the S&amp;P returns and the returns for dip buys of 20%+ in the last month and 50%+ in the last year, so that we don't have a bunch of huge tables. Plus, the overall findings (insider dip buys outperform) remain the same regardless of the cut-off you choose.\n\nOne thing I always like to do is remove 10% Owner purchases and only look at executives/directors, as they tend to be a much better signal.\n\nIf we remove the 10% Owners, the returns improve slightly.\n\n|criteria (excl 10% ownr)|avg\\_3m\\_return|avg\\_1y\\_return|\n|:-|:-|:-|\n|S&amp;P|4.9%|17.3%|\n|prev 1m &lt; -20%|13.7%|36.6%|\n|prev 1y &lt; -50%|15.8%|38.7%|\n\nhttps://preview.redd.it/w998fm738n3g1.png?width=891&amp;format=png&amp;auto=webp&amp;s=40247d15587c9f770e096190900cdf082f917e25\n\nWe also find that this outperformance persists in both large-cap and small-cap stocks (where small-cap is defined as &lt;$2B mkt cap and large-cap is &gt;=$2B).\n\n|criteria (excl 10% ownr)|avg\\_3m\\_return|avg\\_1y\\_return|\n|:-|:-|:-|\n|S&amp;P|4.9%|17.3%|\n|prev 1m &lt; -20% (small)|14.0%|36.4%|\n|prev 1m &lt; -20% (large)|12.2%|38.5%|\n|prev 1y &lt; -50% (small)|15.8%|38.2%|\n|prev 1y &lt; -50% (large)|15.8%|44.7%|\n\nhttps://preview.redd.it/jms4w6958n3g1.png?width=892&amp;format=png&amp;auto=webp&amp;s=449dc0a912dd258b57c396357b9232189b7f13f9\n\nhttps://preview.redd.it/tku936p58n3g1.png?width=890&amp;format=png&amp;auto=webp&amp;s=936f636aac5c37789327d3882bdcc49e11d40b74\n\nNow, one downside of this strategy v the S&amp;P is that it is more volatile and has a lower win rate (a \"win\" is when the stock has positive returns). To be fair, basically all directional strategies have more volatility and a lower win rate than the S&amp;P.\n\n|criteria (excl 10% ownr)|avg\\_1y\\_win\\_rate|1y\\_return\\_range|\n|:-|:-|:-|\n|S&amp;P|90.2%|\\-20% - +77%|\n|prev 1m &lt; -20%|62.3%|\\-82% - +208%|\n|prev 1y &lt; -50%|57.8%|\\-82% - +209%|\n\n**Conclusion**\n\nI've looked at a \\*lot\\* of insider trades, and insider dip buys are certainly one of the highest signal insider trade types (if not the highest signal).\n\nInsiders are very much value investors, and if you consider yourself a value investor, using insider dip buys as a screener is a no-brainer.\n\nHowever, it is a volatile strategy with a much lower win rate than the S&amp;P. This is where your abilities as a stock picker / portfolio manager come into play. If you are not good at it, there is a pretty good chance you will still manage to underperform. If you are good at it, you should be able to increase the average win rate and lessen the volatility.\n\n***Some recent dip insider buys***\n\nhttps://preview.redd.it/3lmxd0lg9n3g1.png?width=1822&amp;format=png&amp;auto=webp&amp;s=16a3e84c95475467d491f3974c98cd4b42cf8b39\n\nArq Inc $ARQ\n\n* environmental tech co - down 50% in the last month due to significant delays and operational issues with the ramp\n* up of its new granular activated carbon (GAC) production line.\n* CEO, CFO, and a director all bought\n* first purchases since May\n\nThryv Holdings $THRY\n\n* SMB marketing software company\n* down 50% in the last month due to deceleration in organic SaaS rev growth and EPS miss\n* CEO and director both bought\n* CEO also bought in August and is down 50%\n\nBTCS Inc $BTCS\n\n* operates cloud-based validator nodes\n* down 40% on EPS miss, share dilution, and poor earnings quality\n* CEO bought\n* first purchase since 2022\n\nFox Factory Holdings $FOXF\n\n* manufactures powered vehicle parts (like suspension)\n* down 40% on double earnings miss and guidance reduction along with consumer weakness concerns\n* CEO bought $300k\n* first purchase since mid-2024\n\nTrex Co $TREX\n\n* world's largest manufacturer of decking / outdoor living products\n* down 40% after missing Q3 profit and sales and lowering guidance (plus consumer weakness concerns)\n* CFO bought $478k\n* first time ever buying the stock\n\nInteger Holdings $ITGR\n\n* medical device CDMO\n* down 35% after lowering 2026 outlook due to slower-than-anticipated adoption of new products\n* CEO, CFO, EVP, and Director all bought\n* first-ever group buying\n\nCertara $CERT\n\n* a biosimulation tech company to help bio companies with drug discovery\n* down 30% due to lower bookings due to Tier 1 customer hesitancy\n* CEO bought $200k\n* first purchase by any insider since 2023 and first-ever purchase by CEO\n\nRedwire Corp $RDW\n\n* an integrated space and defense tech company\n* down 30% because of missed earnings/rev and lowered guidance due to delayed gov contracts\n* CEO, GC, and CAO bought\n* insiders have bought a handful of times in 2025 and it's gone poorly\n\nCelsius Holdings $CELH\n\n* energy drinks\n* down 30% due to net loss and distribution challenges with recently acquired brands\n* president and director both buy\n* first insider buys since 2019\n\nSweetgreen $SG\n\n* fast-casual salad chain\n* down 30% due to slowing same-store sales\n* CEO and chief concept officer both bought\n* first-ever buy for both of them\n\nBath &amp; Body Works $BBWI\n\n* retailer specializing in personal care and home fragrance products\n* down 32% due to earnings miss and reduced guidance due to weak consumer demand.\n* announced a turnaround plan\n* 5 directors bought a combined $907k\n* first-ever group purchase (and only 1 insider purchase at all since 2017)\n\n**Holdings**\n\nOf these, I own TREX ($35.16 cost basis), BBWI ($16.95), THRY ($5.80), and PRMB ($16.64).",
      "score": 459,
      "comments": 50,
      "created_utc": 1764181830.0,
      "author": "wallstreetdata",
      "url": "https://reddit.com/r/StockMarket/comments/1p7fh3q/i_analyzed_120554_insider_trades_since_2009_to/",
      "flair": "Meta",
      "upvote_ratio": 0.98,
      "credibility_score": 8.225000000000001,
      "ai_relevance_score": 0.933875
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "Layoffs in 2025 second-highest since 2009 in potential sign of looming recession",
      "content": "Layoffs in 2025 second-highest since 2009 in potential sign of looming recession",
      "score": 887,
      "comments": 119,
      "created_utc": 1764182221.0,
      "author": "SterlingVII",
      "url": "https://reddit.com/r/Economics/comments/1p7fndg/layoffs_in_2025_secondhighest_since_2009_in/",
      "flair": "News",
      "upvote_ratio": 0.98,
      "credibility_score": 7.925,
      "ai_relevance_score": 0.9233750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "Nobel Prize-Winning Economist Drops Grim Warning For Trump About 'Broader Recession'",
      "content": "Nobel Prize-Winning Economist Drops Grim Warning For Trump About 'Broader Recession'",
      "score": 439,
      "comments": 44,
      "created_utc": 1764172476.0,
      "author": "T_Shurt",
      "url": "https://reddit.com/r/Economics/comments/1p7babc/nobel_prizewinning_economist_drops_grim_warning/",
      "flair": "News",
      "upvote_ratio": 0.97,
      "credibility_score": 7.8999999999999995,
      "ai_relevance_score": 0.9205000000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "US economist alleges ‘industrial-scale fraud’ in India’s H-1B visa pipeline",
      "content": "US economist alleges ‘industrial-scale fraud’ in India’s H-1B visa pipeline",
      "score": 1595,
      "comments": 142,
      "created_utc": 1764168468.0,
      "author": "intelerks",
      "url": "https://reddit.com/r/Economics/comments/1p79l61/us_economist_alleges_industrialscale_fraud_in/",
      "flair": "News",
      "upvote_ratio": 0.96,
      "credibility_score": 7.875,
      "ai_relevance_score": 0.9176249999999999
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "Texas Drops $10 Million On Bitcoin, Officially Buying The Dip First",
      "content": "Texas Drops $10 Million On Bitcoin, Officially Buying The Dip First",
      "score": 540,
      "comments": 65,
      "created_utc": 1764172626.0,
      "author": "KIG45",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7bcqx/texas_drops_10_million_on_bitcoin_officially/",
      "flair": "GENERAL-NEWS",
      "upvote_ratio": 0.94,
      "credibility_score": 7.824999999999999,
      "ai_relevance_score": 0.911875
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "A Google DeepMind researcher and TPU engineer named Amir Yazdan stated on X that the market is \"clueless about hardware and the demand\" following a recent sell-off of Nvidia stock.",
      "content": "A Google DeepMind researcher and TPU engineer named Amir Yazdan stated on X that the market is \"clueless about hardware and the demand\" following a recent sell-off of Nvidia stock.\n\nIn his post, Yazdan observed that the sell-off indicates a fundamental misunderstanding among investors regarding the actual demand for AI hardware. He noted that companies are not buying high-end GPUs like the B200 for general use, but specifically to build and run AI models, an area where demand remains consistently high and unlikely to slow down. ",
      "score": 384,
      "comments": 153,
      "created_utc": 1764144412.0,
      "author": "AppropriateGoat7039",
      "url": "https://reddit.com/r/StockMarket/comments/1p727su/a_google_deepmind_researcher_and_tpu_engineer/",
      "flair": "News",
      "upvote_ratio": 0.89,
      "credibility_score": 7.999999999999999,
      "ai_relevance_score": 0.908
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "MIT study finds AI can already replace 11.7% of U.S. workforce",
      "content": "MIT study finds AI can already replace 11.7% of U.S. workforce",
      "score": 835,
      "comments": 215,
      "created_utc": 1764171034.0,
      "author": "joe4942",
      "url": "https://reddit.com/r/StockMarket/comments/1p7ao6h/mit_study_finds_ai_can_already_replace_117_of_us/",
      "flair": "News",
      "upvote_ratio": 0.92,
      "credibility_score": 7.775,
      "ai_relevance_score": 0.9061250000000002
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "My Final GME DD - Part 3b",
      "content": "My Final GME DD - Part 3b\n\n# VI. Current Events\n\nYou now know the complete sequence of events involved in a carry trade unwind, as well as some historical examples.\n\nJapan *has* delivered almost every element needed for an unwind, except the one that actually causes the unwind to trigger, yen strength.\n\nAnd you know that for the yen to strengthen rapidly, you need a catalyst.\n\nWell I believe that catalyst will be the Bank of Japan.\n\nThe Fed will cut rates in a couple weeks but I don't think this will have the bearish risk-off effect needed to cause an unwind. I don't know what the narrative will be surrounding this cut but I think it'll be a bullish one.\n\nHowever, a cut will be a good thing for an unwind. It won't cause a sell-off but it'll cause the USD to drop and it'll further reduce the US10Y - JP10Y spread.\n\nhttps://preview.redd.it/rhamjlakwn3g1.png?width=2388&amp;format=png&amp;auto=webp&amp;s=7956bed221434cb1ec4cccaa624073413afecd71\n\nTake a look at the response to the last two rate cuts.\n\nWhen the Fed cut rates on September 17th and October 29th, rates actually rose in response. This isn't that abnormal. Rates historically lag by 3-6 weeks after a cut.\n\nSo, if we get a cut on December 10th, then we'd expect to see rates to bottom during the first or second week of January.\n\nNow, I believe the real catalyst will be the Bank of Japan.\n\nDuring their upcoming meeting on December 18th and 19th, I expect them to either:\n\n* Announce a rate hike\n* Release a statement effectively saying they'll allow rates to go higher/normalize\n* Announce yen intervention\n\nThis will be another policy shift. And I believe it'll be one with catalyst-like repercussions.\n\nYou may have heard that the new Japanese Prime Minister authorized a huge stimulus package recently, the largest since Covid. This increase in money results in a weaker yen. That's not what you want if you're goal is to see the carry trade unwind.\n\nThe yen was sinking lower prior to this announcement in anticipation of this stimulus package.\n\nBut, the yen only goes lower if the BoJ plays ball and allows it.\n\nBessent made it clear that that's not what the US wants. \n\nAnd the BoJ has made it clear that that's not what they want either. They announced that they *will* intervene to keep the yen from falling any further.\n\nIt appears that the yen bottomed and USDJPY peaked on November 20th.\n\nRemember when I said that a looming yen shock typically coincides with rumors, leaks from insiders, and statements from BoJ representatives?\n\nWell this is done to put the world on notice that things are about to change. It's supposed to give fair warning to everyone so that they have time to prepare.\n\nLet's take a look at some headlines, in chronological order:\n\nhttps://preview.redd.it/zkyc57eevn3g1.png?width=1429&amp;format=png&amp;auto=webp&amp;s=e19859507981aaa94177e53903f66c54c7d8e061\n\n&gt;\"I am encouraged by her deep understanding of how Abenomics has moved from a purely reflationary policy to a program that must balance growth and inflationary concerns for the citizens of Japan,\" Bessent said in an X post about his meeting with Japanese Finance Minister Satsuki Katayama on Monday.\n\n&gt;\"The government's willingness to allow the Bank of Japan policy space will be key to anchoring inflation expectations and avoiding excess exchange rate volatility,\" he added.\n\n&gt;The comments come ahead of the BOJ's two-day policy meeting ending on Thursday, when markets widely expect the central bank to hold off on raising interest rates.\n\n&gt;They also followed a statement by Bessent on Tuesday, which said he called for a \"sound monetary policy\" in Japan to anchor inflation expectations during his meeting with Katayama.\n\n&gt;\"Bessent might have felt that without his pressure, the BOJ could keep delaying rate hikes,\" said Mari Iwashita, executive rates strategist at Nomura Securities.\n\nhttps://preview.redd.it/96z6kq2hvn3g1.png?width=1405&amp;format=png&amp;auto=webp&amp;s=ad0a5856765a113f1ca15967d7f2a7c08432fb56\n\n&gt;**ESCALATE VERBAL INTERVENTION - HIGHLY LIKELY**\n\n&gt;Authorities have recently said they are watching currency rates with a \"high sense of urgency\" as the yen has been making \"one-sided, sharp\" moves.\n\n&gt;Finance Minister Satsuki Katayama escalated that tone on Tuesday, saying authorities were \"alarmed\" over the yen's volatile moves. Last week, she acknowledged that the disadvantages of a weak yen may be more pronounced than its advantages.\n\n&gt;Analysts say that if the yen makes a sustained break above 155 per dollar and approaches the psychologically important 160 mark, authorities may warn they are ready to take \"decisive action\" against excessive moves - a sign yen-buying intervention could be nearing.\n\nhttps://preview.redd.it/09vdqwhmvn3g1.png?width=1404&amp;format=png&amp;auto=webp&amp;s=f6f2bf5f47a8256502d4a7b65c13d3365b660879\n\n&gt;Her plans will mean yet more borrowing in a quadrillion-yen ($7 trillion) debt market that has been caught off-guard and which no longer enjoys a permanent bid from the central bank or Japan's insurers.\n\n&gt;\"Markets are saying louder and louder that the BOJ is risking falling behind the curve,\" said Ales Koutny, head of international rates at Vanguard in London, who added that a more hawkish approach from the central bank was the only way to stabilize long bonds.\n\nhttps://preview.redd.it/sardc0fqvn3g1.png?width=1430&amp;format=png&amp;auto=webp&amp;s=9a29a8e574d953e58d5ff9c4a381b920ec6bd466\n\n&gt;\"I can't say what month it'll be, but in terms of distance, we're close,\" Masu said on the timing of the central bank's next rate hike, according to the Nikkei, which interviewed him on Thursday.\n\n&gt;In a separate interview with Jiji news agency published on Saturday, Masu said the economic environment for raising interest rates was already falling into place.\n\n&gt;\"It would be a comprehensive decision unless some really bad economic data comes out by then,\" Masu was quoted as saying by Jiji on whether the BOJ could raise rates at its next policy meeting on December 18 and 19.\n\n&gt;The hawkish remarks come after another board member, Junko Koeda, called for raising rates in a speech on Thursday. Two others in the nine-member board have already proposed, albeit unsuccessfully, a hike in September and October.\n\n&gt;Many market players expect the BOJ to raise rates either in December or a subsequent meeting in January next year.\n\n&gt;In keeping policy steady last month, Ueda said the BOJ wanted to await more data on the \"initial momentum\" of next year's wage negotiations before raising interest rates.\n\n&gt;\"It was a good way to get across the message that we're not waiting until after the spring wage negotiations end,\" Masu told Nikkei of the governor's comment.\n\n&gt;Major Japanese firms typically set wages in negotiations with unions around March of each year. Ueda has said the BOJ can get early hints of the outcome through corporate earnings, surveys and comments from corporate executives on the wage outlook.\n\n&gt;The inauguration last month of Prime Minister Sanae Takaichi, known as an advocate of expansionary fiscal policy backed by low rates, has complicated the BOJ's decision on how soon to raise interest rates.\n\n&gt;But the administration has recently signaled its tolerance towards a near-term BOJ rate hike, which would help moderate unwelcome declines in the yen that push up import costs and broader inflation.\n\n&gt;Masu told Nikkei it was important for the BOJ to communicate sufficiently with the government. \"I think we've been able to have them understand that we're close to achieving that goal,\" he was quoted as saying.\n\nhttps://preview.redd.it/50atcncvvn3g1.png?width=1392&amp;format=png&amp;auto=webp&amp;s=1d3fba146420c143a3d3ccc9b39f678d04a73b62\n\n&gt;Japan's cabinet approved a 21.3 trillion yen ($135 billion) stimulus package on Friday, while Finance Minister Satsuki Katayama stepped up yen intervention warnings by specifically threatening to step in if moves were disorderly or excessive.\n\n&gt;Markets expect a few more verbal warnings before actual yen buying somewhere around the 158-162 per dollar range, according to analysts, sell-side surveys and options pricing.\n\nhttps://preview.redd.it/80am40jzvn3g1.png?width=1406&amp;format=png&amp;auto=webp&amp;s=e9121580314f4261009142cacea7d4643727e548\n\n&gt;The currency's fall has also been driven by market bets that Takaichi, known as an advocate of expansionary fiscal and monetary policy, could push back against a near-term rate hike.\n\n&gt;Finance Minister Satsuki Katayama said Japan sees intervention in the foreign exchange market as a possibility in dealing with excessively volatile and speculative moves in the yen, issuing the strongest warning to date against recent falls in the currency.\n\n&gt;Bank of Japan Governor Kazuo Ueda also said the central bank will debate the \"feasibility and timing\" of a rate hike in upcoming meetings, signaling the prospect of increasing still-low borrowing costs as soon as next month.\n\nhttps://preview.redd.it/lrnve9l3wn3g1.png?width=1411&amp;format=png&amp;auto=webp&amp;s=bf9fe889a7f51de2524076d890f2bfde7a15e62f\n\n&gt;In an interview with Reuters on October 9, Aida had said the yen's weakness benefits the economy and the hit to households from rising import costs can be offset by aggressive spending.\n\n&gt;While a weak yen boosts exports, it has become a headache for Japanese policymakers fretting about the inflationary impact such as pushing up import costs.\n\n&gt;The yen is down around 6% since Takaichi was elected leader of her party last month due to market concern that her administration could issue more debt to fund a big spending package, casting doubt on Japan's grip on finances.\n\n&gt;As the yen fell to 10-month lows against the dollar, Finance Minister Satsuki Katayama threatened last week to intervene, in a shift away from the administration's initially sanguine approach over the demerits of a weak currency.\n\nhttps://preview.redd.it/xmchnlm6wn3g1.png?width=1343&amp;format=png&amp;auto=webp&amp;s=c07d49a6dc1f707fdb84d695da52c46dd7835326\n\nhttps://preview.redd.it/l8qdtke8wn3g1.png?width=1404&amp;format=png&amp;auto=webp&amp;s=8bd6fecbd42adbf9f985336efd226a5decadb7a7\n\n&gt;In afternoon trading, the euro rose 0.1% against the dollar to $1.1526, which put the dollar index down 0.1% at 100.15 . Against the Swiss franc, the dollar slid 0.1% to 0.8079 franc .\n\n&gt;The dollar slightly extended its fall after Fed Governor Christopher Waller said on Monday that available data showed the U.S. job market remains weak enough to warrant another quarter-point rate cut at the U.S. central bank's December 9-10 policy meeting.\n\n&gt;\"Certainly, interest rate fundamentals move currencies.\"\n\n&gt;He noted, though, that there were times that the dollar has not moved in line with expectations -- when the Fed is cutting rates, the dollar should be falling.\n\nTalk about sounding the alarm.\n\nNow who knows, maybe this isn't the straw that breaks the camels back.\n\nBut one thing has been made clear, the BoJ won't wait until the after the spring wage negotiations end. They're going to do this in December or January. And the Japanese administration had given the ok.\n\nMy feeling is that this happens at their December meeting.\n\nAnd guess what that lines up with?\n\nThat'll be right when the Fed rate cuts begin materializing in the US10Y rate.\n\nSo, you'll have a Fed rate cut which results in a falling USD and US10Y rate. Combined with a BoJ rate hike and/or yen intervention, which results in a rising yen and JP10Y.\n\nMore systematic stress.\n\nCould the BoJ announcement be the fear that causes carry traders to begin unwinding? Could all of this be coming to head at the end of December or beginning of January?\n\nOr does it take more time to materialize and we don't see cracks in the system for a few more months as stress builds?\n\nWe'll see.",
      "score": 900,
      "comments": 61,
      "created_utc": 1764189933.0,
      "author": "greencandlevandal",
      "url": "https://reddit.com/r/Superstonk/comments/1p7iz9e/my_final_gme_dd_part_3b/",
      "flair": "📚 Due Diligence",
      "upvote_ratio": 0.94,
      "credibility_score": 7.5249999999999995,
      "ai_relevance_score": 0.901375
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "One mile on a bike is a $.42 economic gain to society, one mile driving is a $.20 loss",
      "content": "One mile on a bike is a $.42 economic gain to society, one mile driving is a $.20 loss",
      "score": 2161,
      "comments": 503,
      "created_utc": 1764166207.0,
      "author": "Generalaverage89",
      "url": "https://reddit.com/r/Economics/comments/1p78olb/one_mile_on_a_bike_is_a_42_economic_gain_to/",
      "flair": "News",
      "upvote_ratio": 0.89,
      "credibility_score": 7.699999999999999,
      "ai_relevance_score": 0.8975000000000001
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "My Final GME DD - Part 3a",
      "content": "My Final GME DD - Part 3a\n\nHello Apes! Welcome to Part 3 of My Final GME DD series. There's a link to Parts 1 and 2 below in case you missed them.\n\nThis post will be divided into two sections - Part 3a and Part 3b.\n\nI'm going to post them both at the same time so you can go from one to the next. I don't have a choice because I exceeded the 40,000 character limit.\n\n[My Final GME DD - Part 1 of 3](https://www.reddit.com/r/Superstonk/comments/1p35vjy/my_final_gme_dd_part_1_of_3/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n[My Final GME DD - Part 2 of 3](https://www.reddit.com/r/Superstonk/comments/1p53z8c/my_final_gme_dd_part_2_of_3/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\nFor the past 5 years it's been theorized that MOASS will occur when the market crashes. And since DFV's livestream on June 7th 2024, it's been theorized that the unwind of the Carry Trade would be the candle that blows the hood off this thing.\n\n***\"And now, the end is near***. And so I face the final curtain. My friend, I'll say it clear. I'll state my case, of which I'm certain.\"\n\n**DISCLAIMER:** *The information contained in this post is for general information purposes only. Any reliance you place on such information is strictly at your own risk. It is not intended to constitute legal or financial advice and does not take your individual circumstances and financial situation into account. I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. All information found here, including any ideas, opinions, views, predictions, forecasts, commentaries, suggestions, or stock picks, expressed or implied herein, are for informational, entertainment or educational purposes only and should not be construed as personal investment advice. Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.* \n\n# Contents\n\nI. Revisiting May 2024  \nII. Option Chains  \nIII. Technical Analysis  \nIV. Fractals  \nV. Valuation  \nVI. Japan  \nVII. Outlook\n\n**This post will cover Section VI**.\n\n# VI. Japan\n\n**i. Preface**\n\nI first discussed the yen carry trade in mid-September, when JP10Y broke above 1.65%. Since then, everything has moved as I had expected it to.\n\nExcept for one element.\n\nAnd it’s the most important factor at the heart of the unwind: the yen.\n\nAn unwind of the yen carry trade is not a fast moving event. The actual unwind can be, but the buildup takes years.\n\nEverything needs to be in place by the time the catalyst occurs.\n\nThere are several factors involved leading up to a catalyst. And there could be several different catalysts that lead to an unwinding.\n\nBut, do you know what the trigger is? You guessed it, yen strength.\n\nIf you'd like to revisit my last post to see how far we've come, I'm linking it below.\n\n[The Missing Puzzle Piece - What's going on in the background that nobody is focusing on.](https://www.reddit.com/r/Superstonk/comments/1npodc4/the_missing_puzzle_piece_whats_going_on_in_the/)\n\nLet's begin by talking about what the yen carry trade actually is.\n\n# I. The Yen Carry Trade\n\nThe yen carry trade involves borrowing in low-yielding yen and investing that into higher-yielding USD assets, like US Treasuries.\n\nIt's one of the most influential drivers of liquidity, market rallies, and risk-on behavior.\n\nHere's how it happens exactly:\n\n1. Borrow in JPY - Investors take loans or margin in yen at very low interest rates which gives them cheap capital.\n2. Sell that yen and buy another asset - Investors will then take that yen and convert it to USD, EUR, or AUD to name a few. They then invest in a higher yielding instrument. These investors need to convert the yen if they're going to invest in an instrument that's denominated in another currency. For example, US Treasuries are denominated in USD, so to invest in them you need USD.\n3. Pocket the spread - Those investors will then pocket the difference between the cheap yen borrowing cost and the higher yielding asset that they bought.\n\nThis is a global trading strategy, not just the US. It exploits Japan's historically low interest rates.\n\nIf you can borrow money at near 0%, and then take that money and earn a risk-free 5%, then you're essentially being given free money.\n\nI guess money *can* grow on trees.\n\nThat's why this is a true black swan event. It involves the entire world and trillions of dollars.\n\n**Real World Example:**\n\n1. An investor borrows JPY at .25% cost.\n2. They then buy US Treasury bonds yielding 5%.\n3. The carry is then 4.75%/year.\n\nNow imagine this at 20x leverage across hedge funds, macro desks, and CTA's.\n\nHistorically, this has always worked because Japan has had decades of near-zero interest rates and a central bank willing to suppress yields.\n\nThe BoJ even adopted negative interest rates in 2016 which further amplified the carry trade.\n\nThis is all fine and dandy, until the yen strengthens. \n\nThen you can see violent swings as investors are forced to buy back yen. This unwind can quickly wipe out an entire year, or years, of carry gains.\n\nBut before you see that happen, you'll see several other factors building up leading to that point.\n\nAs long as US yields are high, JP yields are low, and the yen is weak, the carry trade is free money.\n\nBut as soon as yields rise or the yen strengthens, it begins looking less and less attractive.\n\n# II. The Build Up Phase\n\nThis is where we've been the past 3 years.\n\nThe buildup phase can take years to matriculate. But luckily, we're near the very end of this phase. And the next phase, well that happens quickly.\n\nYou'll see signs of stress long before the yen begins strengthening. Yen strengthening is the effect, not the cause.\n\nThe yen doesn't strengthen first, other events unfold, which causes the yen to strengthen. There are many precursors that occur before the yen is ready to surge.\n\nI'm going to present the build up phase below, but it's important to know that this isn't a sequential list. Usually these factors occur simultaneously, in tandem.\n\nSo, this is a just a list of the factors involved, not the order in which they occur.\n\n**a) Policy Shift**\n\nThis happened on December 20th, 2022.\n\nThe BoJ shocked the world by making a surprise policy change where they allowed the 10 year JGB to move from a .25% cap to .5%.\n\nFor 7 years, between January 2016 and December 2022, the Bank of Japan insisted they wouldn't change YCC (yield curve control). JGB rates stayed near zero and even went negative at times.\n\nThen on December 20th, 2022 they widened the yield band from .25% to .5%, doubling the allowable yield.\n\nAfter this the JP10Y broke through the .25% ceiling that had previously been defended and it's drifted higher from that point until present day.\n\nAllowing rates to drift beyond .25% was the inciting incident, not the catalyst.\n\nThis was the true start of the unwind. It was essentially the Bank of Japan stepping back after 7 years of yield-curve control.\n\nThe carry trade was still healthy after this, but a policy shift marked the beginning of the end.\n\nhttps://preview.redd.it/9udmvdo87m3g1.png?width=2393&amp;format=png&amp;auto=webp&amp;s=66996ced0c8e7a38bd68ba228c253954cb97d1d7\n\n**b) Japanese Government Bonds**\n\nOnce the .25% ceiling was allowed to be breached by the Bank of Japan, yields began drifting higher.\n\nAnd they have been ever since.\n\nThis hasn't been a sudden surge. This has been a drift with several milestones along the way, and that's important.\n\nBecause a drift doesn't force an unwind, only a catalyst does.\n\nFirst, it had to get through the new .5% cap.\n\nOn July 28th, 2023 the BoJ announced that .5% isn't a hard cap, its a reference band.\n\nThis meant that they wouldn't defend the .5% level in the same way that they defended the .25% level for so many years. So, the JP10Y was unleashed and allowed to break through.\n\nThen, in April 2024 there was a BoJ meeting where they raised their inflation forecasts. This opened the door for future rate hikes because they were expressing discomfort with yen weakness and rising inflation. They hinted that wages were rising enough to justify tightening.\n\nThis allowed the JP10Y to break above 1.0% to the next hard ceiling, 1.1%.\n\nNot long after this, in July 2024, the Bank of Japan signaled that they would raise rates before the end of the year.\n\nThis is why markets plummeted on August 5th, 2024. It also marked the peak of USDJPY.\n\nAnd sure enough, in December 2024 they announced they're moving towards normalizing yields, which allows rates to float higher. This allowed the 1.1% level to finally be breached after being defended for 6 months.\n\nIt would then continue drifting higher until March 10th, 2025 when it peaked near the 1.6% level.\n\nThen, only a few months ago on August 20th, it was finally allowed to break through.\n\n**It's now sitting at 1.8% looking for the next ceiling to be defended.**\n\n**That is, of course, unless the BoJ says it's ok for it to go higher!**\n\nNow, even though the JP10Y was drifting higher throughout this time, and the spread between the US10Y and JP10Y was narrowing, it didn't trigger an unwind of the carry trade.\n\nThat's because there was no immediate risk.\n\nThe spread was still healthy, so carry trade investors only saw less reward. They didn't see enough risk to the point where it became concerning.\n\nThe carry was always greater than 2.6% during this time.\n\nMaybe they didn't see an immediate threat because Japanese reserves were still high, which meant funding and liquidity were still high, which meant cheap yen.\n\nBut more on this in Section III.\n\nhttps://preview.redd.it/vne1a9zt7m3g1.png?width=2392&amp;format=png&amp;auto=webp&amp;s=c938b930b1f26bf8f9843d04692695c8a9b4c606\n\n**c) US Government Bonds**\n\nNot long after Japan began letting rates tick higher by widening the YCC band and not enforcing caps, US rates began to shrink.\n\nOn October 23rd, 2023 the US10Y peaked near 5%. Since then it's been making lower highs.\n\nAfter rates peaked, the US10Y rate bounced around primarily due to macroeconomic data releases, mainly inflation related indicators like CPI.\n\nAlso, as JGB yields have gone up, Japanese investors, banks, and corporations have begun bringing money back home.\n\nWho do you think are the first people to reallocate? Japanese institutions.\n\n\"Why bother with US treasuries when I can get yield at home?\"\n\nBesides the historically high rate, Japanese investors don't have any currency risk, hedging costs, dollar basis, or swap haircuts when they bring money back home.\n\nSo, in addition to macro data, perhaps this is also the reason for some of the choppiness and stickiness in treasury rates.\n\nOn January 14th, 2025 the US10Y had it's third and final peak.\n\nAfter this, whispers of a rate cut began circulating, especially with Trump becoming the new president. He made it very clear that he wanted lower rates.\n\nFinally, on September 17th, 2025, we got our first cut. And not soon after, on October 29th, we got the second one.\n\nThe rate now sits at 3.75% - 4% with additional cuts on the way.\n\nIn conclusion, we have an environment since January 2023 where JGB rates have drifted higher and US rates have drifted lower, thus shrinking the gap between the US10Y and JP10Y.\n\nThe spread currently sits around 2.2%.\n\nYou may be thinking that's still high. But it's important to know that the spread doesn't need to collapse entirely for the yen to begin strengthening. It needs to be stressed just enough to the point where a catalyst, or event, drives it over the edge. Then rates can really collapse quickly once the yen begins strengthening.\n\nIf you look at past examples of the USDJPY plummeting - 1998, 2015, and 2022 - the interest rate differential was still wide when the yen strengthened and USDJPY collapsed.\n\nHowever, once the carry trade begins unwinding, the US10Y - JP10Y gap can narrow extremely fast.\n\nThink of UST and JGB rates as stress signals. That's why they're part of the buildup phase.\n\nRisk-Off is the true catalyst for an unwind. Because that's what causes the yen to surge. And a surging yen is all that matters.\n\nSo, what will be the catalyst I wonder? That'll be in the Current Events section.\n\nhttps://preview.redd.it/c6z9m06t2h3g1.png?width=804&amp;format=png&amp;auto=webp&amp;s=7464743b3fb22b37bbbfaef00aae02c9ff34fc17\n\n**d) SPX and Nikkei**\n\nBetween December 20th, 2022 - March 10th, 2025 both US and Japanese markets surged to all time highs.\n\nThe USDJPY made all time highs as well, while respecting the 140 support level.\n\nThis is typical of the buildup phase. Think 1998, 2007, and 2015 when China devalued their currency and caused a risk-off panic. Markets were at all time highs for all of these events.\n\nFrom 2013 - 2023 BoJ reserves were exploding upwards.\n\nWe had Abenomics + Quantitative Easing + Yield Curve Control. The Bank of Japan bought massive amounts of JGB's which injected new reserves into the banking system. Those banks then deposited the money back to the BoJ. This is the QE dynamic that dominated Japan for a decade.\n\nBetween August 2011 - May 2022 US10Y rates never exceeded 3%.\n\nAnd between August 2019 - March 2022 they never exceeded 2%.\n\nMoney was cheap.\n\nMarkets have still looked fine beyond 2022 because the liquidity and funding have still been in place and FX hasn't snapped yet.\n\nThe yen is still cheap and the US10Y - JP10Y spread is still wide enough. So, the carry is still earning a healthy return.\n\nPolicy shifted, but the plumbing was still in tact. Money was in the system and the yen was cheap.\n\nCarry traders typically don't exit early, they exit when forced to.\n\nThe trade is too big and too connected to everything else.\n\nThis reminds me of the scene from Tombstone when they're all looking at each other wondering who's going to shoot first.\n\nWho's going to buy back yen first?\n\nhttps://preview.redd.it/2s9of0t58m3g1.png?width=2401&amp;format=png&amp;auto=webp&amp;s=13a0017baa138fd714f7b4838aa9b1aaa4bc6d6a\n\n**e) Japanese Reserves**\n\nhttps://preview.redd.it/px93v93r0g3g1.png?width=1413&amp;format=png&amp;auto=webp&amp;s=beca4c13b0da0fe40decd454a844b1d928b3b215\n\nYou've probably seen this chart. While I can't see the exact date, I'm guessing the drop coincides with September 19th.\n\nThe JP10Y hasn't traded below 1.6% since then.\n\nYou can see reserves totaled 186.2T on November 19th. That's a far cry from the \\~$475T not too long ago. That's a 60% drop.\n\nThis part always come late cycle, after yields have already drifted.\n\nThe BoJ just yanked liquidity. The tap is being turned off.\n\nWhen reserves collapse, banks can't borrow cheap yen. Yen liquidity dries up. FX swaps go up. Repo conditions tighten. The carry becomes harder to fund.\n\nThis is a structural shock and where the unwind begins to become unavoidable. This is when carry desks begin to think about exiting.\n\nThe unwind actually starts when the plumbing shifts like this. It's just that no one can see it yet.\n\nThis takes place behind the scenes. No one even notices that the funding system has changed.\n\nDealers lose collateral, yen funding becomes scarcer, repo spreads widen, all in silent.\n\nIt's the calm before the storm, before markets notice or care.\n\nAnd if funding JPY becomes less abundant, more expensive, and harder to roll, then what happens? \n\nCarry desks begin to stress.\n\nWe're in that fragile, late-cycle phase of the buildup. We're teetering near the edge.\n\n**f) USDJPY**\n\nThe yen is the last piece of the puzzle.\n\nDuring the buildup phase we don't expect USDJPY to plummet. In fact, we historically see the opposite.\n\nYou typically see a top form and then it stops making higher highs. It stalls and consolidates near the high.\n\nThe reason why Japanese bonds matter is because the JPY borrowing cost is anchored by their domestic risk-free rate, which is the JP10Y. The funding markets are priced relative to JGB yields. \n\nAs the JP10Y goes up, the cost of capital in yen goes up.\n\nYou may be asking, \"If JP10Y rates have been going up, why is the yen near historic lows and  USDJPY at 30 year highs?\".\n\nWell, for one, entities could actively be pushing the yen down.\n\nA weak yen supports Japanese exports and margins. Major corporations like Toyota, Sony, Nintendo, Honda, and Mitsubishi all want a weak yen.\n\nA weak yen also pushes inflation into Japan, which the government has wanted.\n\nAnd lastly, carry traders want a weak yen so they can prolong their trade. It's one of the easiest trades in the world. They'll ride this wave until the catalyst.\n\nWhen you combine the Japanese government, Japanese corporations, and all the carry desks in the world, that's quite a large group.\n\nWhy do you think the yen is the last domino to fall?\n\nThere are some typical behaviors that accompany a looming yen shock. You'll see things like the Nikkei or SPX crash -3% or -5% in a day.\n\nYou'll hear leaks and quotes from insiders or executives hinting towards BoJ rate hikes. You'll have BoJ governors openly talking to the press about intervening.\n\nThis is when Japanese megabanks, corporations, and the rest of the world begins hedging and buying yen.\n\nI believe this where we are right now. We're about to see USDJPY begin to drop and the yen begin to strengthen.\n\nWhen the Fed cuts rates in a few weeks, that should also cause DXY to drop, which could cause the USDJPY to drop further.\n\nWhen USDJPY, Nikkei, and SPX begin to drop together, while the yen strengthens, then it's go time.\n\nhttps://preview.redd.it/iqzlh5wjam3g1.png?width=2395&amp;format=png&amp;auto=webp&amp;s=35641272692ddef72b914310d0bf473841b8681e\n\n**g) Buildup Phase Conclusion**\n\nIn conclusion, we have:\n\n1. Policy changes from Japan - no more suppressing yields.\n2. JP10Y being allowed to drift higher with a hike on the way.\n3. US10Y drifting lower with more rate cuts on the way.\n4. USDJPY stalls and stops making new highs.\n5. SPX and Nikkei form blow off tops.\n6. Funding/Liquidity/Reserves being drained.\n\nEverything is trending in the right direction and nearly in place for an unwind to take place.\n\nAll of the preconditions have been met.\n\nThe last piece of the puzzle is a catalyst. This event needs to cause the yen to surge. Not drift, surge.\n\nBecause while the buildup phase takes years, an unwind is swift and violent.\n\n# III. The Catalyst Phase\n\nThis phase begins with an event, or catalyst.\n\nIt marks the official beginning of the unwind, when it becomes visible to the public.\n\nThere could be several different catalysts that act as a trigger, but the common theme among them all is that all of them are risk-off signals.\n\nThis causes a sell-off of equities, unless the equity sell-off *is* the catalyst. It'll also cause FX and FX volatility to blow up.\n\nThe plumbing is showing signs of cracking in Japan. This usually happens months before the unwind.\n\nNow all we need is a little push.\n\n* BOJ lets yield drift higher = No exits\n* USDJPY stalls = No exits\n* Shrinking carry trade spread = No exits\n* Markets ATH = No Exits\n* Bullish Narratives = No Exits\n\nThese are preconditions.\n\nBut then suddenly the BoJ rug-pulls liquidity. Borrowing costs go up. Funding goes away. FX swaps go bid, not ask. Margin calls start occurring.\n\nIt's time for a catalyst.\n\n**a) Catalyst**\n\nOnce everything is lined up for an unwind to take place, a catalyst comes next.\n\nThis is a big event that causes a risk-off fire sale to take place, and it's sudden.\n\nIt's not something like CPI, it's something that makes carry desks nervous and forces their hand.\n\nRemember, the carry trade is the easiest trade in the world. And they won't abandon it unless they absolutely need to.\n\nThis trade has tentacles that extend across different markets and the entire global financial system.\n\nSo we're talking a major event that shifts sentiment and causes a fear-based sell-off, especially for leveraged carry traders.\n\nHere are some possible catalysts:\n\n* Fed bearish cut (risk-off cut)\n* BoJ hike, policy shift, intervention, or stops defending rates\n* US equities crash due to fear (AI Bubble, etc.)\n* Corporate credit blowout, or another credit event\n* Nikkei crashes\n* USDJPY intervention threat\n* China devalues causing an FX panic (2015)\n* T-Bill shortage\n* JPY swap freeze\n* Global volatility spike (Risk event)\n* USD or JPY liquidity stress\n* Geopolitical shock like Taiwan\n* Major banks or hedge funds fail like SVB\n* Tariffs\n\nBasically anything that is a major risk-off signal.\n\nThis causes FX volatility to explode which is essential for an unwind.\n\n**b) Yen**\n\nAfter the catalyst, the yen begins strengthening sharply. The yen always strengthens after funding breaks.\n\nThis isn't a drift higher over 3 years, this is a surge.\n\nWe'll go over historical examples later, but typically this surge can takes place over the course of a day, a week, or up to 3 months.\n\nBecause carry traders are short the yen and levered, they rush to buy yen to cover their funding.\n\nAs more and more carry traders buy yen to cover, it amplifies, causing the yen to surge higher. The entire world is forced to deleverage, fast.\n\nVolatility spikes, USDJPY crashes, yen futures surge.\n\nAs USDJPY breaks key supports, dealers become short gamma. As it continues dropping, that accelerates causing a feedback loop.\n\nCarry traders dump foreign assets, then buy yen to unwind funding, causing the yen to strengthen, which makes funding costs rise even more, which causes more forced selling of other assets, which causes more yen buying.\n\nIt's a feedback loop that accelerates as the yen gets stronger and stronger.\n\nThis is why sell-offs happen aggressively and the yen strengthens rapidly. This is the opposite of a drift.\n\n**c) US Government Bonds**\n\nAs global fear spikes and equities sell-off, money flows aggressively into US Treasuries. This causes yields to collapse.\n\nThis is when you can see the US10Y - JP10Y spread really begin to narrow.\n\nYou may be thinking, \"Wouldn't carry traders be forced to sell their US Treasuries in order to buy back yen?\", and \"Wouldn't that cause yields to go up?\".\n\nThe answer is yes, that logic makes sense. But during an unwind other forces dominate.\n\nThe selling of US Treasuries by carry traders is no match for the global flows that rush *into* treasuries during an event like this.\n\nThe magnitude of safe-haven flows overwhelms the carry traders forced deleveraging.\n\nAs all of this is going on, JGB yields rise modestly. Domestic demand shifts as Japanese investors repatriate funds back to their homeland.\n\nTheir domestic bonds have become more attractive, especially as US Treasury yields collapse due to a risk-off flight to safety.\n\nA weak yen usually pushes JGB yields up. And a stronger yen usually pushes JGB yields down. We have a historically weak yen right now as JGB yields have drifted higher.\n\nHowever, this relationship doesn't always hold during an unwind due to the BoJ having stepped in.\n\nAnd like US Treasuries, the yen is also a safe-haven asset.\n\nSo, seeing the yen strengthen during risk-off events is typical.\n\nIn conclusion, during the unwind the US10Y - JP10Y spread narrows rapidly.\n\n**d) Forced Liquidations and Margin Calls**\n\nDuring this part global deleveraging is taking place.\n\nLeveraged carry traders get stopped out. Quant funds and algorithmic models delever. Global equities crash, emerging markets fall, collateral plummets, commodity currencies weaken, VIX spikes hard.\n\nThis is where systemic market-wide volatility appears.\n\nThe unwind accelerates until spreads stabilize, leverage is dead, and systemic risk is absorbed.\n\nMarkets usually begin to stabilize because central banks step in and stop it from going any further.\n\nThe BoJ intervenes and shows readiness to act. Perhaps the Fed or US government intervene as well.\n\nOnce these announcements are made, everything calms down.\n\nThis is the classic ending.\n\nThe BoJ or MoF may step in and restore liquidity or sell FX reserves. This is them announcing to the world that they won't tolerate any further yen appreciation.\n\nThe Fed may cut aggressively. This is typical for recessions, liquidity crises, and when banks are stressed.\n\nThe bloodbath ends. Bank funding recovers, demand for USD returns, the yen weakens.\n\nJapan may expand YCC again, restart bond purchases driving yields lower, add reserves, provide USD swap lines, or lower short-term rates.\n\nThe unwind is complete.\n\n# IV. The Complete Sequence of an Unwind\n\n1. Policy Shift\n2. JGB drift higher\n3. US Treasuries drift lower\n4. Markets form blowoff tops\n5. USDJPY peaks and stalls out\n6. Funding/Reserves/Liquidity gets rug-pulled\n7. A catalyst hits signaling risk-off\n8. Yen surges causing forced deleveraging\n9. US10Y - JP10Y spread collapses\n10. Central Banks and Governments intervene to stabilize markets\n\n# V. The History of the Carry Trade\n\n**a. Prequel**\n\nThe carry trade began during Japan's \"Lost Decade\".\n\nJapan got trapped in deflation.\n\nThe 1985 Plaza Accord resulted in G5 countries purposely devaluing the USD. USDJPY then fell of a cliff from 260 to 160 within \\~12 months.\n\nIt continued down to 120.\n\nJapan's bubble peaked around January 4th, 1990 when Nikkei was just under 39,000.\n\nReal estate was up, leverage had ballooned.\n\nThen it all came crashing down. By October, Nikkei was down to 20,000, nearly a 50% crash.\n\nJapan responded with a zero interest rate policy (ZIRP) and quantitative easing. Yield curve control came later.\n\n**b. The Birth of the Yen Carry Trade**\n\nWhen Japan announced ZIRP, macro hedge funds realized that you can borrow USD, convert it to JPY, borrow at near-zero rates, lever up, and use that to buy global assets.\n\nJapan had just been trapped in deflation, so there was no inflation risk.\n\nThey had a cooperative BoJ who was keeping yields pinned and providing a predictable policy stance.\n\nAnd so, the yen became the world's funding currency.\n\nBelow are some examples of carry trade unwinds.\n\n**c. 1997 - 1998**\n\nhttps://preview.redd.it/itomqjjkan3g1.png?width=2397&amp;format=png&amp;auto=webp&amp;s=4585a5edd081cd7744b03fbee99f257263a44225\n\nhttps://preview.redd.it/9fb7kepoan3g1.png?width=2401&amp;format=png&amp;auto=webp&amp;s=21ce5a08f1f73d390c6a9382cc2739e6edba96ec\n\nYou probably know of 1998 as a period of euphoria. Crazy evaluations, companies IPO'ing left and right, Pets.com, highly overvalued companies, etc.\n\nWhat you might not know is that this was the first famous unwind of the yen carry trade.\n\nLong-Term Capital Management (LTCM) was a hedge fund who blew up and received a $3.6B bailout from 14 banks in a deal arranged by the Federal Reserve Bank of New York.\n\nWithin four months, LTCM lost $4.6B, in part due to highly leveraged exposure to the Russian and Asian financial crisis.\n\n* $1.6B in swaps\n* $1.3B in equity volatility\n* $430M in Russian and other emerging markets\n* $371M in directional trades in developed markets\n* $215M in yield curve arbitrage\n* $203M in S&amp;P stocks\n* $100M in junk bond arbitrage\n\nAs a result of this, global investors unwound their carry trade and bought yen to repay the funding.\n\nUSDJPY collapsed from 148 to 112 in a matter of weeks, losing nearly 25%.\n\nIn the second image above you can see that the spread was still healthy when this happened.\n\nIf you take the lowest the US10Y was during this time, around 4.2%, and the highest the JP10Y was during this time,  around 1.5%, you still have a spread of 2.7%.\n\nThese occurred at different times though. The real spread was actually always over 3.2%.\n\n**e) 2007 - 2008**\n\nAround August 2003, Japan's Ministry of Finance executed the largest FX intervention in their history up to that point.\n\nThey ended their year-long dollar buying campaign.\n\nThey were selling yen and buying dollars to keep USDJPY high and weaken the yen. They defended the USDJPY 115 level and prevented it from going beneath that.\n\nThe total intervention was equal to $200B in 2003 dollars.\n\nThen, around September 2003, they stopped and USDJPY collapsed instantly. The artificial floor disappeared and true yen demand surfaced.\n\nThis is an example of how BoJ intervention effects markets. As soon as BoJ stopped defending 115, it collapsed right through it.\n\nThis shows that when a central bank stops suppressing something, or causing something, the immediate market reaction is violent.\n\nThen, the carry trade reached its golden years between 2005 - 2007, just before the Global Financial Crisis in 2008.\n\nBoJ kept rates at 0% - .25%. The Fed hiked rates to 5.25% under Greenspan. Housing prices were elevated. China was booming. Carry traders were having a field day.\n\nThen, we all know what happened in 2008.\n\nVIX exploded, banks blew up, funding collapsed.\n\nThe world deleveraged and closed positions causing the yen to rally.\n\nUSDJPY collapsed from 124 to 87.\n\nOn June 22nd, 2007 the JPY10Y was at 1.888%. And on December 17th, 2008 the JPY10Y was at 1.297%.\n\nThat means that the spread right before the financial crisis between the US10Y and JP10Y was around 3.3%. And by December 2008 it was less than 1%.\n\nThis goes to show that the spread doesn't need to be catastrophically narrow for an unwind to begin.\n\nIt also shows that when everything crashes and crumbles, that's when you can really see the carry spread narrow tightly.\n\nhttps://preview.redd.it/j9r8heaoln3g1.png?width=2399&amp;format=png&amp;auto=webp&amp;s=f67147caec77bb5f853ac1f7657cea64b7f75c96\n\n**f) 2015 - 2016**\n\nIn 2015 and 2016 you had two events take place. You had the devaluing of China's currency and Brexit.\n\nOn August 11th, 2015 China devalued the yuan overnight causing global panic. A sharp sell-off ensued.\n\nUSDJPY peaked right at this moment. SPX and Nikkei were also both at all time highs.\n\nVIX exploded and there was a massive risk-off wave globally.\n\nMoney then was driven into the world's safe-haven currency, the yen.\n\nThese events are an example of an unwind not being driven by the JP10Y.\n\nThey're also examples of how quick USDJPY can drop, with both of them resulting in huge drops within days.\n\nhttps://preview.redd.it/qq4eegntrn3g1.png?width=2393&amp;format=png&amp;auto=webp&amp;s=6cbddbbce2f5147a7844baa6940a29dfeca85935\n\nThe above are just three examples of a carry trade unwind.\n\nWhat they show us is that:\n\n* The US10Y - JP10Y spread doesn't need to be that narrow for an unwind to occur.\n* An unwind doesn't need to occur because of interest rates.\n   * China devaluation, Brexit, Covid, a Hedge Fund or bank blowing up, etc.\n   * Taiwan is a possible trigger\n* An unwind can happen from days, as is the case in 2015 and 2016, to 6 months, as is the case in 2008.\n   * 1998 was right in the middle with it taking place over roughly a month.\n\nThey all have similar features though, like markets being at all time highs, USDJPY being elevated, and a risk-off event causing the unwind.\n\nThat concludes Part 3a. Please visit the link below to continue with Part 3b.\n\n[My Final GME DD - Part 3b](https://www.reddit.com/r/Superstonk/comments/1p7iz9e/my_final_gme_dd_part_3b/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
      "score": 687,
      "comments": 42,
      "created_utc": 1764189804.0,
      "author": "greencandlevandal",
      "url": "https://reddit.com/r/Superstonk/comments/1p7ixc4/my_final_gme_dd_part_3a/",
      "flair": "📚 Due Diligence",
      "upvote_ratio": 0.92,
      "credibility_score": 7.4750000000000005,
      "ai_relevance_score": 0.8956250000000001
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "Never give up",
      "content": "Never give up\n\nAbandoned the casino for a few years to recoup. \n\nCame back around October and started trading daily SPX credit spreads mostly. \n\nFinally back in the green today, going to try to be a lot more disciplined going forward. ",
      "score": 474,
      "comments": 82,
      "created_utc": 1764197841.0,
      "author": "MrDanGugly",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7m8fg/never_give_up/",
      "flair": "Gain",
      "upvote_ratio": 0.96,
      "credibility_score": 7.125,
      "ai_relevance_score": 0.891375
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "GameStop on Twitter",
      "content": "GameStop on Twitter",
      "score": 1445,
      "comments": 197,
      "created_utc": 1764198535.0,
      "author": "Mikeymike34",
      "url": "https://reddit.com/r/Superstonk/comments/1p7mic9/gamestop_on_twitter/",
      "flair": "📳Social Media",
      "upvote_ratio": 0.94,
      "credibility_score": 7.074999999999999,
      "ai_relevance_score": 0.8856250000000001
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "+2.75%/$0.58 GameStop Closing Price $21.64 - Market Cap $9.693 Billion (Wednesday Nov 26, 2025)",
      "content": "+2.75%/$0.58 GameStop Closing Price $21.64 - Market Cap $9.693 Billion (Wednesday Nov 26, 2025)\n\nVolume: 4,261,466\n\nGME-WS: +6.83%/$0.19 Closing Price $2.97 🟩 ",
      "score": 1481,
      "comments": 33,
      "created_utc": 1764191053.0,
      "author": "Little-Chemical5006",
      "url": "https://reddit.com/r/Superstonk/comments/1p7jghu/275058_gamestop_closing_price_2164_market_cap/",
      "flair": ":Bar_Chart: Data",
      "upvote_ratio": 0.97,
      "credibility_score": 6.699999999999999,
      "ai_relevance_score": 0.8785000000000001
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "META, Facebook may have earned $12–14B from fraudulent ads ; EU could hit a €1B fine",
      "content": "META, Facebook may have earned $12–14B from fraudulent ads ; EU could hit a €1B fine\n\nRecent reports suggest that **Facebook/Meta has generated $12–14 billion from fraudulent advertising**. Essentially, the company profits while users fall victim to scams.\n\nIf the **European Union enforces stricter penalties**, Meta could face a **record €1 billion fine**, which would have significant financial and reputational implications. This raises serious questions for investors: how much risk does regulatory action pose to Meta’s revenue model?",
      "score": 693,
      "comments": 87,
      "created_utc": 1764184328.0,
      "author": "Plus_Seesaw2023",
      "url": "https://reddit.com/r/investing/comments/1p7gky6/meta_facebook_may_have_earned_1214b_from/",
      "flair": null,
      "upvote_ratio": 0.97,
      "credibility_score": 7.85,
      "ai_relevance_score": 0.8687499999999999
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "They Will Say You Just Got Lucky...",
      "content": "They Will Say You Just Got Lucky...\n\nSource: [https://x.com/globalrashid007/status/1990309391988674832](https://x.com/globalrashid007/status/1990309391988674832)",
      "score": 403,
      "comments": 26,
      "created_utc": 1764191481.0,
      "author": "kirtash93",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7jn6w/they_will_say_you_just_got_lucky/",
      "flair": "MEME",
      "upvote_ratio": 0.95,
      "credibility_score": 7.55,
      "ai_relevance_score": 0.86825
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "Trump canceling GDP report comes under scrutiny",
      "content": "Trump canceling GDP report comes under scrutiny",
      "score": 5676,
      "comments": 160,
      "created_utc": 1764176248.0,
      "author": "ScannerBrightly",
      "url": "https://reddit.com/r/Economics/comments/1p7cypz/trump_canceling_gdp_report_comes_under_scrutiny/",
      "flair": "News",
      "upvote_ratio": 0.97,
      "credibility_score": 6.3999999999999995,
      "ai_relevance_score": 0.8680000000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "My experience as a millennial",
      "content": "My experience as a millennial",
      "score": 1499,
      "comments": 130,
      "created_utc": 1764139946.0,
      "author": "ClutchReverie",
      "url": "https://reddit.com/r/economy/comments/1p70zj4/my_experience_as_a_millennial/",
      "flair": null,
      "upvote_ratio": 0.98,
      "credibility_score": 7.574999999999999,
      "ai_relevance_score": 0.8611249999999999
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "GameStop on Twitter",
      "content": "GameStop on Twitter",
      "score": 511,
      "comments": 22,
      "created_utc": 1764201842.0,
      "author": "CachitoVolador",
      "url": "https://reddit.com/r/Superstonk/comments/1p7nq08/gamestop_on_twitter/",
      "flair": "📳Social Media",
      "upvote_ratio": 0.97,
      "credibility_score": 5.949999999999999,
      "ai_relevance_score": 0.85225
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "OpenAI needs to raise at least $207bn by 2030 so it can continue to lose money, HSBC estimates",
      "content": "OpenAI needs to raise at least $207bn by 2030 so it can continue to lose money, HSBC estimates",
      "score": 346,
      "comments": 26,
      "created_utc": 1764171171.0,
      "author": "ya-reddit-acct",
      "url": "https://reddit.com/r/Economics/comments/1p7aqay/openai_needs_to_raise_at_least_207bn_by_2030_so/",
      "flair": "News",
      "upvote_ratio": 0.97,
      "credibility_score": 7.8999999999999995,
      "ai_relevance_score": 0.8389
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Trump sign “GENESIS” AI - The modern day Manhattan/ Apollo project",
      "content": "Trump sign “GENESIS” AI - The modern day Manhattan/ Apollo project\n\nPresident Trump signed an executive order meant to accelerate scientific discovery through the use of artificial intelligence, directing the Energy Department and its national labs to build an integrated AI platform using their existing and future supercomputers.\n\nWhite House officials told reporters on the conference call that they want to bring in AI supercomputing technology to speed the research and scientific discovery process by analyzing massive data sets in the science, engineering, energy and health care spaces from the federal government, university and private sector.\n\nThe official have received significant interest from companies that include Nvidia and Dell, as the administration intends to build more supercomputers.\n\nMore help from Congress could be needed down the road for extra funding and the administration will leverage all available resources to continue to invest increasing amounts for the success of the mission.\"\n\nhttps://apnews.com/article/genesis-mission-trump-ai-25acaea44113c2b60111e8b142344737",
      "score": 295,
      "comments": 195,
      "created_utc": 1764137824.0,
      "author": "Front-Nectarine4951",
      "url": "https://reddit.com/r/stocks/comments/1p70e59/trump_sign_genesis_ai_the_modern_day_manhattan/",
      "flair": "Industry News",
      "upvote_ratio": 0.76,
      "credibility_score": 6.175,
      "ai_relevance_score": 0.8181250000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "Fox News claims Thanksgiving dinner is cheaper this year.\n\nHave you noticed that when buying your Thanksgiving stuff?",
      "content": "Fox News claims Thanksgiving dinner is cheaper this year.\n\nHave you noticed that when buying your Thanksgiving stuff?",
      "score": 473,
      "comments": 252,
      "created_utc": 1764186579.0,
      "author": "Conscious-Quarter423",
      "url": "https://reddit.com/r/economy/comments/1p7hjyw/fox_news_claims_thanksgiving_dinner_is_cheaper/",
      "flair": null,
      "upvote_ratio": 0.9,
      "credibility_score": 6.775,
      "ai_relevance_score": 0.817125
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "Trump’s approval rating negative with every pollster for first time ever",
      "content": "Trump’s approval rating negative with every pollster for first time ever",
      "score": 385,
      "comments": 26,
      "created_utc": 1764182648.0,
      "author": "SterlingVII",
      "url": "https://reddit.com/r/economy/comments/1p7fu72/trumps_approval_rating_negative_with_every/",
      "flair": null,
      "upvote_ratio": 0.96,
      "credibility_score": 7.825,
      "ai_relevance_score": 0.815475
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "Strategy Stock Crashes 60% But Michael Saylor Refuses To Step Aside",
      "content": "Strategy Stock Crashes 60% But Michael Saylor Refuses To Step Aside",
      "score": 274,
      "comments": 79,
      "created_utc": 1764166151.0,
      "author": "Omegacarlos1",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p78ns7/strategy_stock_crashes_60_but_michael_saylor/",
      "flair": "🟢 GENERAL-NEWS",
      "upvote_ratio": 0.79,
      "credibility_score": 7.449999999999999,
      "ai_relevance_score": 0.81435
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "After securing a $55 billion deal to acquire Battlefield 6 and EA Sports FC publisher EA, Saudi Arabia's Public Investment Fund is reportedly \"unable to allocate any more money\" for the time being | The PIF claims to hold about $1 trillion in assets, but it's not so simple",
      "content": "After securing a $55 billion deal to acquire Battlefield 6 and EA Sports FC publisher EA, Saudi Arabia's Public Investment Fund is reportedly \"unable to allocate any more money\" for the time being | The PIF claims to hold about $1 trillion in assets, but it's not so simple",
      "score": 349,
      "comments": 33,
      "created_utc": 1764145361.0,
      "author": "ControlCAD",
      "url": "https://reddit.com/r/business/comments/1p72gp7/after_securing_a_55_billion_deal_to_acquire/",
      "flair": null,
      "upvote_ratio": 0.98,
      "credibility_score": 8.175,
      "ai_relevance_score": 0.814125
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "What Are Your Moves Tomorrow, November 27, 2025",
      "content": "What Are Your Moves Tomorrow, November 27, 2025\n\nThis post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1p7jacr)",
      "score": 161,
      "comments": 3281,
      "created_utc": 1764190666.0,
      "author": "wsbapp",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7jacr/what_are_your_moves_tomorrow_november_27_2025/",
      "flair": "Daily Discussion",
      "upvote_ratio": 0.92,
      "credibility_score": 5.075,
      "ai_relevance_score": 0.8116250000000002
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "Buck on X about GameStop Golden Ticket on X 😆🤣",
      "content": "Buck on X about GameStop Golden Ticket on X 😆🤣",
      "score": 339,
      "comments": 17,
      "created_utc": 1764207624.0,
      "author": "bahits",
      "url": "https://reddit.com/r/Superstonk/comments/1p7ppsy/buck_on_x_about_gamestop_golden_ticket_on_x/",
      "flair": "📳Social Media",
      "upvote_ratio": 0.97,
      "credibility_score": 7.599999999999999,
      "ai_relevance_score": 0.8084
    },
    {
      "type": "trending_news",
      "subreddit": "Superstonk",
      "title": "We all know the truth.",
      "content": "We all know the truth.",
      "score": 362,
      "comments": 23,
      "created_utc": 1764196607.0,
      "author": "Zachet",
      "url": "https://reddit.com/r/Superstonk/comments/1p7lqvw/we_all_know_the_truth/",
      "flair": "🤡 Meme",
      "upvote_ratio": 0.85,
      "credibility_score": 7.3,
      "ai_relevance_score": 0.8019000000000002
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "Sweet Quantum Losses",
      "content": "Sweet Quantum Losses\n\nThis is the way!",
      "score": 198,
      "comments": 92,
      "created_utc": 1764189775.0,
      "author": "ironchef8000",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7iwwp/sweet_quantum_losses/",
      "flair": "Loss",
      "upvote_ratio": 0.95,
      "credibility_score": 7.1,
      "ai_relevance_score": 0.7941
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "The Fed is stopping Quantative Tightening in December. In January it is likely they will pivot to QE. This often signals a bull run.",
      "content": "The Fed is stopping Quantative Tightening in December. In January it is likely they will pivot to QE. This often signals a bull run.\n\n#1 rule of investing- don’t fight the Fed.\n\nThe fed announced it would stop QT and reducing the balance sheet in December. They didn’t say if or when they’d pivot to QE, but the expectation is it will be next year (still speculative). \n\nQE (aka printing money) almost always correlates (causes?) a bull run in the stock market and assets to go up. A Quick Look at qe vs the market show this. A great example is 2020-2022. However, printing money also can lead to inflation if too much money chase only so many assets. We also saw this in 2022.\n\n\nSo how do you think this will play out ? Will QE help avoid a recession and improve the labor market ? Will it cause bad inflation or even stagflation? Is this a situation where “don’t fight the fed” is finally wrong ?",
      "score": 299,
      "comments": 165,
      "created_utc": 1764173039.0,
      "author": "UnderstandingThin40",
      "url": "https://reddit.com/r/stocks/comments/1p7bjdw/the_fed_is_stopping_quantative_tightening_in/",
      "flair": null,
      "upvote_ratio": 0.81,
      "credibility_score": 6.550000000000001,
      "ai_relevance_score": 0.79125
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "MIT study finds AI can already replace 11.7% of U.S. workforce",
      "content": "MIT study finds AI can already replace 11.7% of U.S. workforce\n\n* Massachusetts Institute of Technology released a study that found that artificial intelligence can already replace 11.7% of the U.S. labor market.\n* The study was conducted using a labor simulation tool called the Iceberg Index, which was created by MIT and Oak Ridge National Laboratory.\n* For lawmakers preparing billion-dollar reskilling and training investments, the index offers a detailed map of where disruption is forming down to the zip code.\n\nMassachusetts Institute of Technology on Wednesday released a study that found that artificial intelligence can already replace 11.7% of the U.S. labor market, or as much as $1.2 trillion in wages across finance, health care and professional services.\n\nBeneath the surface lies the total exposure, the $1.2 trillion in wages, and that includes routine functions in human resources, logistics, finance, and office administration. Those are areas sometimes overlooked in automation forecasts.",
      "score": 618,
      "comments": 365,
      "created_utc": 1764171700.0,
      "author": "Guy_PCS",
      "url": "https://reddit.com/r/investing/comments/1p7ayal/mit_study_finds_ai_can_already_replace_117_of_us/",
      "flair": null,
      "upvote_ratio": 0.83,
      "credibility_score": 6.3,
      "ai_relevance_score": 0.7865000000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economics",
      "title": "Only 46 % of adults say they have enough emergency savings to cover three months of expenses, while 24 % report having none at all",
      "content": "Only 46 % of adults say they have enough emergency savings to cover three months of expenses, while 24 % report having none at all",
      "score": 295,
      "comments": 46,
      "created_utc": 1764185589.0,
      "author": "Basic_Bird_8843",
      "url": "https://reddit.com/r/Economics/comments/1p7h4qz/only_46_of_adults_say_they_have_enough_emergency/",
      "flair": null,
      "upvote_ratio": 0.96,
      "credibility_score": 8.125,
      "ai_relevance_score": 0.7859750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "World stocks climb after Wall Street rallies on hopes for lower interest rates",
      "content": "World stocks climb after Wall Street rallies on hopes for lower interest rates",
      "score": 234,
      "comments": 28,
      "created_utc": 1764165248.0,
      "author": "Cristiano1",
      "url": "https://reddit.com/r/StockMarket/comments/1p78asr/world_stocks_climb_after_wall_street_rallies_on/",
      "flair": "News",
      "upvote_ratio": 0.97,
      "credibility_score": 7.8999999999999995,
      "ai_relevance_score": 0.7525
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "Bitcoin price target: JPMorgan predicts BTC USD could hit $240,000 and reveals why crypto is acting like a macro asset",
      "content": "Bitcoin price target: JPMorgan predicts BTC USD could hit $240,000 and reveals why crypto is acting like a macro asset",
      "score": 217,
      "comments": 44,
      "created_utc": 1764193482.0,
      "author": "TheGreatCryptopo",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7kh5w/bitcoin_price_target_jpmorgan_predicts_btc_usd/",
      "flair": "GENERAL-NEWS",
      "upvote_ratio": 0.86,
      "credibility_score": 7.925,
      "ai_relevance_score": 0.743375
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "My P/L just printed -∞% on NQ shorts. Apparently 100% loss wasn’t enough",
      "content": "My P/L just printed -∞% on NQ shorts. Apparently 100% loss wasn’t enough\n\nhttps://preview.redd.it/l2681a4ujp3g1.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=c2b4b20588e6053bd65a3d1adcdd6c5a5aa98c40\n\n**Everyone:** ‘You can only lose 100%.’  \n**My broker:** *introduces the concept of limits from calculus* 💀",
      "score": 171,
      "comments": 45,
      "created_utc": 1764209291.0,
      "author": "tincyboo",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7q9e2/my_pl_just_printed_on_nq_shorts_apparently_100/",
      "flair": "YOLO",
      "upvote_ratio": 0.95,
      "credibility_score": 7.85,
      "ai_relevance_score": 0.7235499999999999
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "Bitcoin Reclaims $90K Ahead of Thanksgiving as Ethereum, XRP Bounce Back",
      "content": "Bitcoin Reclaims $90K Ahead of Thanksgiving as Ethereum, XRP Bounce Back",
      "score": 150,
      "comments": 27,
      "created_utc": 1764188881.0,
      "author": "kirtash93",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7ijnh/bitcoin_reclaims_90k_ahead_of_thanksgiving_as/",
      "flair": "GENERAL-NEWS",
      "upvote_ratio": 0.96,
      "credibility_score": 7.875,
      "ai_relevance_score": 0.680825
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "$37 —&gt; $10,021",
      "content": "$37 —&gt; $10,021\n\nGot lucky from 38 to 735 on RGTI calls, and the rest was history.\n\nBeen scalping SPX calls the past few weeks, and repeating the process.\n\nI would say the first few trades was all luck, then compounding started from there.\n\nNext stop, 100k ",
      "score": 157,
      "comments": 53,
      "created_utc": 1764184352.0,
      "author": "Tran5",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7glbx/37_10021/",
      "flair": "Gain",
      "upvote_ratio": 0.88,
      "credibility_score": 6.925,
      "ai_relevance_score": 0.6787750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Tax implications from GOOGL - need some advice",
      "content": "Tax implications from GOOGL - need some advice\n\nI hope there are some great legal minds here that can help me with a tax question:\n\nI bought GOOGL at 100 and went pretty hard in. It has now grown to be almost 40% of my portfolio.\n\nI want to de-risk as i am not overly confident GOOGL will grow more than 15% annually from these levels.\n\nMy problem is that my tax on gains will be 38% as i live in Norway. So my options are as follows:\n\n1. Just hold it forever. And keep the risk\n2. Give away almost half of my gains to the tax authority\n3. Reduce my position and still give away half of my gains to the tax authority\n\nIs there anything else i can do? Any other options? My broker is IBKR if that is of any help.\n\nEdit: Thanks for all the replies guys. I did not expect to get so many honestly. Honestly i appreciate the input and if anyone cares I will keep the shares. Google is a compounder and a spawner. They have a great history of allocating capital (youtube, maps, doubleclick, etc) and im sure they will outperform me",
      "score": 64,
      "comments": 191,
      "created_utc": 1764165222.0,
      "author": "analbuttlick",
      "url": "https://reddit.com/r/stocks/comments/1p78af0/tax_implications_from_googl_need_some_advice/",
      "flair": null,
      "upvote_ratio": 0.74,
      "credibility_score": 4.575,
      "ai_relevance_score": 0.664925
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "I should get off margin account",
      "content": "I should get off margin account\n\nMy buying power is almost 4x of current cash I am holding and it is little scary at this point maybe I should sell all the losers and get off margin in case I blow up everything I have…. I have to cross this company on option expire due to stupid ai mod keep deleting…",
      "score": 89,
      "comments": 77,
      "created_utc": 1764204755.0,
      "author": "Ineedstopcovercalyol",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7oqt6/i_should_get_off_margin_account/",
      "flair": "Loss",
      "upvote_ratio": 0.93,
      "credibility_score": 6.3,
      "ai_relevance_score": 0.6509
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "I saw this poll today on TV...",
      "content": "I saw this poll today on TV...\n\n76% have a negative view of the economy!",
      "score": 156,
      "comments": 36,
      "created_utc": 1764202905.0,
      "author": "Choobeen",
      "url": "https://reddit.com/r/economy/comments/1p7o3ph/i_saw_this_poll_today_on_tv/",
      "flair": null,
      "upvote_ratio": 0.96,
      "credibility_score": 7.525,
      "ai_relevance_score": 0.637775
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "I bought a stock low, sold it high… and now I feel like a clown?",
      "content": "I bought a stock low, sold it high… and now I feel like a clown?\n\nSo here’s what happened:\n\nA few weeks ago I bought a small position in a stock (nothing crazy), basically because it dipped during a bad earnings reaction. My plan was to hold long-term, but last week it randomly spiked like 18% in a day after some analyst upgrade.\n\nI panicked, thought “profit is profit,” and sold.\n\nOf course, the next three days it kept climbing… and now it’s up way higher than where I sold. I’m sitting here staring at the chart like I just speedran the definition of paper hands.\n\nWas selling the smart move or am I actually a clown for not sticking to my plan?",
      "score": 58,
      "comments": 138,
      "created_utc": 1764203220.0,
      "author": "wizard_folio",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7o7u4/i_bought_a_stock_low_sold_it_high_and_now_i_feel/",
      "flair": "Stock Analysis",
      "upvote_ratio": 0.71,
      "credibility_score": 4.85,
      "ai_relevance_score": 0.6289500000000001
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Hot take on today s Fed shift",
      "content": "Hot take on today s Fed shift\n\nSo JPM just flipped *again*. A week ago they swore the Fed would hold until January… and now they’re saying we might actually get a **December rate cut**.\n\nWhat changed?  \nApparently the recent “soft landing” vibes from multiple Fed officials especially Williams  were enough for JPM s economists to rethink their whole call. They’re now expecting **two 25 bps cuts: Dec + Jan**.\n\nAs someone who s been in this market long enough to see the Fed whiplash more times than I can count… this one caught my eye.  \nIf the Fed really opens the door in December, that’s a very different setup for year-end positioning than what most of us were planning even a few days ago.\n\nMy questions for you all:\n\n* Does a December cut actually make sense here, or is JPM just chasing the narrative?\n* How are you positioning into year-end if this becomes the consensus?\n* Anyone else feel like the Fed’s “data dependent” line is basically mood-dependent at this point?\n\nCurious how everyone s reading this, because this shift could change the whole risk-on/risk-off balance heading into Q4.",
      "score": 120,
      "comments": 50,
      "created_utc": 1764195541.0,
      "author": "One_Affectp",
      "url": "https://reddit.com/r/stocks/comments/1p7lbf1/hot_take_on_today_s_fed_shift/",
      "flair": null,
      "upvote_ratio": 0.92,
      "credibility_score": 7.425000000000001,
      "ai_relevance_score": 0.6198750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "NOOO!!! $NVO DOWN 10% IN A DAY",
      "content": "NOOO!!! $NVO DOWN 10% IN A DAY\n\nOh. Sorry I misread.. that was 2 days ago.. now it’s back at the same level as last week. Let’s be real anyone thinking that Novo is not getting out of this slump eventually is too emotional:\n\n- cash cow with massive consistent FCF \n- roughly 45% market share in diabetes care (structural growth market)\n- one of the biggest players in obesity (structural growth market)\n- deep next gen pipeline\n- strong clinical approval rating\n- reasonable valuation against historical averages\n- net margins: 30-33%\n\nYes, if you would have invested in $LLY 6 months ago you would have more money. If my grandma would have wheels and 6.2L HEMI supercharged V8 she would be a Dodge Challenger SRT Hellcat..\n\nOpportunities like this are to be assessed based on facts, not on emotions. \n\nHave a good day! ",
      "score": 101,
      "comments": 116,
      "created_utc": 1764170742.0,
      "author": "Educational_Ad_6303",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7ajnr/nooo_nvo_down_10_in_a_day/",
      "flair": "Discussion",
      "upvote_ratio": 0.66,
      "credibility_score": 4.425,
      "ai_relevance_score": 0.603275
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "S&amp;P downgrades USDT’s dollar peg rating to lowest score",
      "content": "S&amp;P downgrades USDT’s dollar peg rating to lowest score",
      "score": 50,
      "comments": 19,
      "created_utc": 1764198804.0,
      "author": "GreedVault",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7mm0x/sp_downgrades_usdts_dollar_peg_rating_to_lowest/",
      "flair": "🔴 UNRELIABLE SOURCE",
      "upvote_ratio": 0.86,
      "credibility_score": 7.625,
      "ai_relevance_score": 0.5592750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "Workday shares sink on subscription revenue guidance concerns",
      "content": "Workday shares sink on subscription revenue guidance concerns",
      "score": 25,
      "comments": 11,
      "created_utc": 1764183252.0,
      "author": "Force_Hammer",
      "url": "https://reddit.com/r/StockMarket/comments/1p7g3rj/workday_shares_sink_on_subscription_revenue/",
      "flair": "News",
      "upvote_ratio": 0.95,
      "credibility_score": 7.85,
      "ai_relevance_score": 0.55235
    },
    {
      "type": "trending_news",
      "subreddit": "CryptoCurrency",
      "title": "House Democrats Issue Report Detailing Trump Crypto Ties as 'New Age of Corruption'",
      "content": "House Democrats Issue Report Detailing Trump Crypto Ties as 'New Age of Corruption'",
      "score": 45,
      "comments": 7,
      "created_utc": 1764201054.0,
      "author": "Abdeliq",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1p7nfpv/house_democrats_issue_report_detailing_trump/",
      "flair": "🟢 GENERAL-NEWS",
      "upvote_ratio": 0.91,
      "credibility_score": 7.75,
      "ai_relevance_score": 0.5504500000000001
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "From Giants To Microcaps: 7 Energy Storage Winners To Watch",
      "content": "From Giants To Microcaps: 7 Energy Storage Winners To Watch\n\nFederal EV and solar credits may be fading, but the battery and storage buildout is not slowing down at all. EVs are already over 20% of global auto sales, and U.S. grid capacity is hitting records as solar and storage projects stack up. The big question now is not “if” storage wins, but which names you want on your screen.\n\nOn the large cap side, you have Panasonic (PCRHY) as a core battery supplier with over $5B in fiscal 2024 energy revenue. BYD (BYDDY) dominates EVs in China and runs one of the largest battery operations on the planet. Albemarle (ALB) feeds the whole system with lithium, even if commodity prices whack the stock short term.\n\nNextEra (NEE) is the utility play, one of the biggest wind and solar operators and deeply tied to grid scale storage. Bloom Energy (BE) offers solid oxide fuel cell systems already deployed at 1,000+ sites. Enphase (ENPH) is the rooftop and small commercial angle with microinverters and home batteries. ABB (ABBNY) is the wiring, panels, UPS and integration layer that makes these systems actually work in the real world.\n\nIf you want a tiny, higher risk grid play on your side list, NХХТ is a microcap moving from fuel delivery into microgrids and storage. It just signed a 28 year PPA for a healthcare microgrid in California with 409 kW solar and 300 kW battery storage, expected to generate about $5M over the contract life. Small name, but it sits right at the edge where storage, backup, and real world infrastructure meet.\n\nNot financial advice.",
      "score": 38,
      "comments": 4,
      "created_utc": 1764179242.0,
      "author": "AvaRobinson506",
      "url": "https://reddit.com/r/StockMarket/comments/1p7eba6/from_giants_to_microcaps_7_energy_storage_winners/",
      "flair": "Fundamentals/DD",
      "upvote_ratio": 0.91,
      "credibility_score": 7.75,
      "ai_relevance_score": 0.54005
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Full recap - Interview with Nebius CRO Marc Boroditsky",
      "content": "Full recap - Interview with Nebius CRO Marc Boroditsky\n\nHi folks!\n\nWatched a recent interview online with Nebius CRO Marc Boroditsky and thought I'd share a full recap here because I keep seeing posts and comments that tell me many people still fail to understand the industry as a whole and more specifically Nebius' long term vision and market positioning.\n\nFor key segments that I do believe are still highly misunderstood to this day, they are mostly discussed in #8, 11, 12, 13, 14 and 17.\n\nDisclaimer: I am invested in Nebius and the interview was led by Nebius investors and Nebius leadership (CRO Marc Boroditsky). Although I do agree with everything that was discussed in the interview, I am aware that many people share different opinions and will disagree with various things that were said in the interview. I am also aware that many people either do not believe in Nebius long term success or see better opportunities with other players in the market for various reasons, which is totally fair. Hence, feel free to express your thoughts in the comments below.\n\nI am sharing this here for information purposes only since Nebius Group is a popular choice among retail.\n\nIn case you are looking for the interview, it can be easily be found online. It's called ''$30B AI Expert: The Real Money is in Inference - Nebius CRO Marc Boroditsky''. Can't share it here.\n\nRECAP below:\n\n1. Interviewers asked how Nebius managed to close such massive multibillion-dollar deals with tech giants like Microsoft and Meta so quickly given the company is relatively new to the market\n\nMarc explains that while he would love to take the credit, it was actually a massive cross-functional effort involving the corporate development, legal, platform, and infrastructure teams who navigated these complex negotiations from start to finish. He points out that winning the trust of these iconic companies required proving that Nebius had the rigorous legal framework and operational maturity to serve as a reliable long-term partner for the world's largest enterprises. He mentions that these deals aren't just simple transactions but require a deep alignment on infrastructure, reliability, and compliance that only a fully matured organization can deliver.\n\n2. Interviewers asked if the guidance of reaching 7 to 9 billion in revenue by 2026 is actually achievable given the extreme logistical challenges of building data centers at that speed\n\nMarc explains that they are treating physical infrastructure with the same agile methodology used in software development. This allows them to run multiple supply chain and power acquisition tracks in parallel (\"multi-threaded\") rather than doing things sequentially. He notes that typical infrastructure deployment takes years because companies wait for one step to complete before starting the next (e.g., waiting for a permit to begin planning). Nebius compresses these timelines by operating simultaneously on all fronts. He confirms that the contracts and equipment orders needed to hit these numbers are already being executed right now rather than just being a plan on paper for the future. He says their confidence comes from the fact that they aren't waiting for permits to start planning but are moving on all fronts simultaneously to compress timelines, maintaining the \"thirst and drive\" of a startup even at scale.\n\n3. Interviewers asked for a specific breakdown of what the difference is between contracted power and connected power in their financial reports and why that distinction matters for investors\n\nMarc explains that \"contracted power\" means having a legally binding agreement with a utility or supplier to provide energy capacity, whereas \"connected power\" means the electricity is live, in production, and ready for servers to run revenue-generating workloads. He says that the leadership team is extremely sensitive to only reporting milestones that are fully matured and actionable, rather than sharing \"half-baked\" or speculative capacity that might never materialize. This distinction is very important because it shows they are only counting power that is secured and commercially viable.\n\n4. Interviewers asked about their pricing power and if they are taking advantage of the current shortage of GPU compute to charge maximum rates to every customer\n\nMarc admits that while the extreme supply imbalance would allow them to charge high premiums, they are strategically choosing to prioritize long term relationships over maximizing short-term profit. They prioritize Large Enterprises (e.g., Fortune 500 companies), High-Growth AI Natives (startups with clear runway and technical focus), and Major Software Vendors (ISVs). These clients are selected based on their commitment to a long-term partnership and their need for a full-stack, secure, high-performance solution. He explains that their goal is to support companies that will grow with them over the long term, meaning they sometimes say \"no\" today to keep the door open for a more strategic \"yes\" tomorrow. This disciplined approach is fundamental to building a durable, high-quality recurring revenue stream.\n\n5. Interviewers asked what the biggest limiting factor is for scaling the business right now and if getting Nvidia chips is still the main problem for Nebius\n\nMarc makes it clear that access to GPUs is effectively solved due to their privileged, high-level partnership with Nvidia, so the real bottlenecks are now physical assets like land availability and power capacity, as well as the capital required to fund them. He adds that having the massive capital required to actually purchase the equipment to fill these data centers is the other major hurdle. Nebius has successfully overcome this due to their clean balance sheet and capital engines, such as their ATM facility and debt structures. He implies that while others struggle to find chips, Nebius is purely focused on the logistics of deploying the hardware they have already secured access to.\n\n6. Interviewers asked how they approach green energy and if they have strict sustainability mandates that might slow down their deployment at new data center sites\n\nMarc explains that their decision-making is primarily financial and pragmatic. They are willing to use various energy sources, including gas or nuclear, as long as the deal meets their strict internal rate of return (IRR) and margin requirements. He explicitly states that their focus is on securing the lowest possible cost of energy to maintain their superior unit economics. He mentions they are open to using temporary power solutions to get sites running quickly while they work on transitioning to more permanent and efficient power configurations over time. He clarifies that while they care about sustainability, they won't let \"perfect\" energy sources be the enemy of getting deployed fast enough to meet customer demand, noting they are energy consumers, not producers, meaning their priority is securing reliable, low-cost power quickly, regardless of the source.\n\n7. Interviewers asked about growth metrics beyond just new customer acquisition, specifically regarding net dollar retention and how existing customers are expanding their usage\n\nMarc points out that while year-over-year comparisons are difficult given the company's youth, their quarter-over-quarter expansion is extremely robust. Major accounts, like software vendors, are often doubling their usage sequentially, growing at rates above typical SaaS (Software as a Service) growth rates. He notes a shift in workloads from \"spiky\" model training to more predictable and reliable inferencing workloads, which he believes is where the real commercialization of AI lies. He says that as customers move from training to retraining and then to inferencing, the \"stickiness\" and revenue consistency improve significantly, driving growth rates that exceed typical SaaS benchmarks.\n\n8. Interviewers asked if he is worried about competition from Bitcoin miners who are pivoting to offer AI compute services and if that supply will hurt Nebius\n\nMarc doesn't see this as a threat because running high-performance AI clouds requires complex engineering, cooling, and software discipline that crypto miners simply don't possess or understand. He differentiates their capabilities, noting that miners excel at managing simple, homogeneous hash workloads, but lack the ability to handle the complex, heterogeneous orchestration needed for serious AI training and inferencing. He states that sophisticated customers running mission-critical workloads will always choose a company with deep technical roots over a converted mining operation that cannot guarantee uptime, security, or proper orchestration. He believes the market for AI infrastructure is distinct because it requires a full software stack and support layer (the \"AI Cloud\") that miners cannot easily replicate just by plugging in GPUs.\n\n9. Interviewers asked if Nebius would consider acquiring any of these Bitcoin miners to gain access to their power and land assets given the scarcity of infrastructure\n\nMarc admits that \"crazy markets make strange bedfellows\" and that they look at all options, but he says they prefer to build and control their own infrastructure to ensure unit economics, reliability and performance. He suggests that while they are open to any opportunities and very creative, they would likely pass on most M&amp;A opportunities in this space because the miners often don't \"check all the boxes\" required for Nebius's high standards. He reaffirms that maintaining control over every detail of the infrastructure is key to their long-term operational success.\n\n10. Interviewers asked about the current market realities and skepticism regarding the valuations and asking prices of these potential infrastructure targets\n\nMarc points out that we are currently in a \"crazy market\" where valuations for these assets are often irrational and don't make financial sense for a disciplined buyer. He states that sellers often expect prices far beyond what is rational. This means Nebius, which is focused on margins and unit economics, would likely only consider such moves during a market pullback when prices return to reality. He frames this discipline not as a lack of ambition but as a refusal to overpay for assets that don't justify their cost.\n\n11. Interviewers asked about the future of the \"rental\" business model and if bare-metal GPU rental is destined to become a commodity race to the bottom\n\nMarc agrees that for a small subset of the market comfortable with \"DIY\" (Do it Yourself) infrastructure, bare metal will become a commodity. He notes that Nebius is fine with this commodity business existing on the side, since their focus is strictly on the premium, full-stack opportunity. He says that the vast majority of the market (two-thirds of IT spend) comes from enterprises that demand a full-service experience. He explains that these large organizations (like Proctor &amp; Gamble or Pfizer) don't want to manage raw hardware. They want a fully integrated platform that handles the complexity for them. He says that bare-metal providers only offer one small piece of the solution (the GPU), leaving the client responsible for building the rest of the stack (the managed Kubernetes, networking, security, and observability), which can cost millions or require cobbling together services from third-party vendors. He says Nebius is avoiding the \"race to the bottom\" by focusing on this premium, value-added layer rather than just renting out raw server capacity.\n\n12. Interviewers asked about the specific nature of enterprise demand and whether large legacy companies are actually moving to these new AI platforms\n\nMarc explains that enterprises are increasingly moving to service providers that offer a full stack of capabilities because \"operating the lower layers\" internally is inefficient and costly for them. He mentions that even if a \"bare metal\" option looks cheaper on a price-per-hour basis, it ends up losing the customer money due to the massive operational overhead required to manage it. He states that enterprises do not want to spend months cobbling together a functional AI environment because their focus must be on time-to-market and their core business objectives (e.g., selling cars, discovering drugs). The opportunity cost of diverting highly paid engineers to manage infrastructure far outweighs any perceived hardware savings. He predicts that the same dynamic seen in the cloud era, where customers flocked to integrated providers like AWS, will play out in AI. Enterprises will choose Nebius for the seamless ecosystem and speed of deployment rather than raw cost savings.\n\n13. Interviewers asked how Nebius differentiates itself from the major hyperscalers (AWS, Azure, Google) and the other players emerging\n\nMarc breaks the market down into three categories: 1) Bare metal \"digital real estate\" players, 2) Traditional hyperscalers who rely on \"cookie-cutter\" uniformity to manage scale, and 3) \"Specialty Infrastructure\" players like Nebius. He explains that hyperscalers struggle with the specialized needs of AI workloads because their business models depend on commoditization and standardization, which forces them to appeal to the \"lowest common denominator\" user. In contrast, Nebius is building a platform specifically optimized for the AI engineer, not the generalist DevOps engineer. This specialization allows them to support distinct, high-performance workloads (like drug discovery or robotics) that generalist clouds cannot serve as effectively.\n\n14. Interviewers asked for a deeper explanation of \"Specialty Infrastructure\" and why it can compete effectively against giants like AWS\n\nMarc compares this to companies like Cloudflare, which compete with hyperscalers by doing one specific thing (security/networking) significantly better and more efficiently. He argues that \"Specialty Infrastructure\" for AI allows Nebius to capture premium workloads that demand higher performance and reliability, thereby commanding better margins. This advantage isn't just software deep, but comes from engineering architecture built specifically for the most complex AI tasks, which is structurally difficult for generalist clouds to replicate. By focusing entirely on the needs of the AI engineer rather than the generalist DevOps engineer, Nebius creates a \"best-of-breed\" solution that justifies a premium valuation and market position.\n\n15. Interviewers asked about the importance of cybersecurity in this integrated cloud and if it is a major factor for their enterprise customers\n\nMarc confirms that security is absolutely critical. He notes that as workloads move to inferencing over the internet, identity access management and data protection become mandatory. He explains that customers are putting their most valuable IP on the platform, so Nebius must deliver security parity with the hyperscalers. He says that you cannot simply offer compute, you must deliver the full \"Dev-Ops-Security\" wrapper (managed Kubernetes, observability, identity) to be a viable partner for serious enterprises. He confirms that Nebius is offering the whole Dev-Ops-Security package.\n\n16. Interviewers asked if there is concrete feedback from customers proving that their vertical integration and software platform actually create a competitive advantage\n\nMarc shares a story about a CTO of a large software vendor who moved workloads to Nebius specifically because \"my engineers like your platform better.\" He explains that the \"stickiness\" of the product comes from the behavioral preference of developers who find Nebius's tooling and spin-up times superior. He argues that this long-term stickiness is less about traditional technical lock-in and more about winning the \"hearts and minds\" of the AI engineer persona, who are \"creatures of habit\" with their tools. He specifically cites his experience at Twilio, stating that once you get an engineer on the platform, the next time they have a workload, they just start with that platform. This creates a powerful flywheel effect meaning engineers who learn how to run workloads on Nebius will start asking for it in future roles and organizations, creating sales opportunities that \"come through the back door.\" Nebius is actively fueling this by hiring a developer relations leader to build a multi-million AI engineer community around their platform. He adds that because Nebius hires extremely high-quality, high-level engineers for their support teams, they manage to bypass the traditional L1/L2/L3 escalation model common in the industry. This means that when customers call, the initial engineer can often solve the problem immediately, which drives confidence, trust, and continued usage versus competitors that need to constantly escalate. He states that customers know the performance and reliability advantages of an integrated platform are worth paying a premium for, rather than risking fragmented, cobble-together solutions just to save a few cents per hour.\n\n17. Interviewers asked how the revenue and profit split between their infrastructure services and their software platform will evolve over the coming years\n\nMarc predicts that while hardware drives revenue now, the software and platform layer (the \"AI Cloud\") will eventually generate the majority of their profit and value. He compares their trajectory to other major cloud providers where the real margin comes from proprietary tools, storage, and inferencing services rather than the raw infrastructure itself. He emphasizes that building and maintaining this sophisticated AI software platform requires extremely high-end, highly specialized engineers. He points out that for many companies, it is already difficult and expensive to find any engineers, let alone highly skilled AI engineers, making the talent required to build an internal platform a massive barrier to entry. He shares a story of a large software vendor customer with 21 different AI product teams who needs a single software \"control plane\" to manage them. He says that this isn't possible today and that it shows the massive long-term opportunity lies in solving these software complexity problems instead of just renting GPUs.\n\n18. Interviewers asked why Marc decided to join Nebius after his previous successes and what specific factors convinced him to commit to this role\n\nMarc says that after leaving Cloudflare, he was looking for a \"horizontal\" platform opportunity rather than a vertical application or a risky foundation model company. He was ultimately convinced by Nebius because it combined a massive total addressable market (TAM) with a \"capital engine\" capable of fueling growth and a leadership team (Arkady, Roman, Andrey) that was \"humble yet technically brilliant.\" He highlights Nebius's unique origin story, leveraging the core team's experience in building high-scale, AI-driven infrastructure from their time at Yandex. He saw the three critical ingredients for success such as industry-leading technology, an outstanding team, and ready access to growth capital. He notes that finding a company that already had a working commercial product, a clean balance sheet, and the engineering culture to execute on a generational vision was a rare alignment that turned him from a skeptic into a closer.\n\n19. Interviewers asked what makes him most excited about the future and what investors should look for in the coming execution phase\n\nMarc is excited about the \"execution\" phase, which is all about building a go-to-market machine that can reach the \"four corners of the market\" to sell the massive capacity they are bringing online. He emphasizes that execution means the massive and complex task of operationalizing the deployed capacity and effectively commercializing the software platform at scale. He talks about the impending \"enterprise stampede\" into AI, predicting that while legacy companies are slow to move now, Nebius is positioning itself to capture that massive wave when it breaks by focusing on delivering enterprise-ready, full-stack AI services. He wraps up by saying this is the biggest \"generational opportunity\" of his career and that he's confident Nebius will become an \"iconic company\" that defines this new era of infrastructure.",
      "score": 20,
      "comments": 10,
      "created_utc": 1764188971.0,
      "author": "polynesiantrapezius",
      "url": "https://reddit.com/r/stocks/comments/1p7ikzs/full_recap_interview_with_nebius_cro_marc/",
      "flair": "Company Discussion",
      "upvote_ratio": 0.86,
      "credibility_score": 7.625,
      "ai_relevance_score": 0.5208750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Thoughts on BRK and their cash reserve as a safehaven for any market downturn in the next 1-2 years?",
      "content": "Thoughts on BRK and their cash reserve as a safehaven for any market downturn in the next 1-2 years?\n\nBerkshire is holding a large reserve of cash at the moment. There’s nonstop talk about an AI bubble popping/ incoming recession. Can’t time the market, obviously - so wondering if BRK would be a a good safehaven + lower my exposure from my currently all equities portfolio. \n\nWould love to hear your thoughts ",
      "score": 44,
      "comments": 60,
      "created_utc": 1764181126.0,
      "author": "UniqueChemical2942",
      "url": "https://reddit.com/r/stocks/comments/1p7f5ox/thoughts_on_brk_and_their_cash_reserve_as_a/",
      "flair": "Advice Request",
      "upvote_ratio": 0.8,
      "credibility_score": 5.075,
      "ai_relevance_score": 0.5188250000000001
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "Unpopular opinion: Most people shouldn’t be trading individual stocks",
      "content": "Unpopular opinion: Most people shouldn’t be trading individual stocks\n\nHonestly, after watching the market the last few years, I’m starting to think most people (including me sometimes) have no business trading individual stocks.\n\nEveryone talks like they’re a genius after one lucky trade, but almost nobody actually beats the market long term. Half of Reddit is chasing hype, FOMO buying, or copying some influencer who disappears after being wrong once.\n\nMeanwhile, boring index funds quietly outperform like 80% of traders anyway.\n\nIs this actually true or am I being dramatic? Starting to feel like the whole ‘stock picking’ culture is just gambling with extra steps.",
      "score": 52,
      "comments": 56,
      "created_utc": 1764213248.0,
      "author": "wizard_folio",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7rjbk/unpopular_opinion_most_people_shouldnt_be_trading/",
      "flair": "Discussion",
      "upvote_ratio": 0.79,
      "credibility_score": 5.05,
      "ai_relevance_score": 0.51595
    },
    {
      "type": "trending_news",
      "subreddit": "wallstreetbets",
      "title": "Accidentally made 6k yesterday &amp; 9k today",
      "content": "Accidentally made 6k yesterday &amp; 9k today",
      "score": 56,
      "comments": 49,
      "created_utc": 1764207726.0,
      "author": "Bitech2",
      "url": "https://reddit.com/r/wallstreetbets/comments/1p7pqzg/accidentally_made_6k_yesterday_9k_today/",
      "flair": "Gain",
      "upvote_ratio": 0.69,
      "credibility_score": 5.7,
      "ai_relevance_score": 0.5107
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "ANOTHER major tech company announces 6,000 job cuts as workers are replaced by robots",
      "content": "ANOTHER major tech company announces 6,000 job cuts as workers are replaced by robots\n\nWould the last human worker to be replaced by robots &amp; AI please turn out the lights?",
      "score": 58,
      "comments": 8,
      "created_utc": 1764189454.0,
      "author": "Key_Brief_8138",
      "url": "https://reddit.com/r/economy/comments/1p7is6l/another_major_tech_company_announces_6000_job/",
      "flair": null,
      "upvote_ratio": 0.91,
      "credibility_score": 7.7,
      "ai_relevance_score": 0.5107
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "China’s CO2 emissions have been flat for 18 months. Just in 2024 and 2025 (so far), China has installed 600GW of solar and wind energy capacity.",
      "content": "China’s CO2 emissions have been flat for 18 months. Just in 2024 and 2025 (so far), China has installed 600GW of solar and wind energy capacity.",
      "score": 23,
      "comments": 2,
      "created_utc": 1764213260.0,
      "author": "wakeup2019",
      "url": "https://reddit.com/r/economy/comments/1p7rjg4/chinas_co2_emissions_have_been_flat_for_18_months/",
      "flair": null,
      "upvote_ratio": 1.0,
      "credibility_score": 8.225,
      "ai_relevance_score": 0.509475
    },
    {
      "type": "trending_news",
      "subreddit": "stocks",
      "title": "Broadcom DD: Highly overvalued",
      "content": "Broadcom DD: Highly overvalued\n\nAs of today, Broadcom's marketcap is roughly 1.8T (it's closer to 1.9T but still) Nvidia's marketcap in comparison is roughly 4.3T This brings Broadcom at about 40% valuation of Nvidia\n\n\n\nNow Broadcom made about 15.9 B dollars in profit, for a 4.2 B in Net Revenue.\n\n\n\nAbout 9.2 B ( \\~ 60%) comes from Semiconductor related business And the rest, 6.8 B (\\~ 40%) comes from Software\n\n\n\nNow Broadcom bought VMware and increased prices by a lot, so much that they gained a lot of ill-will, and those who can try to get out of their ecosystem. They are taking a page out of Oracle's book, and this will hold companies hostage for a while, but the price increases are so insane, going up to 10x, that some companies either must find an alternative, or risk going bankrupt. \\[1\\] \\[2\\]\n\n\n\nI believe, Broadcom will stagnate in growth in their software department, but will increase prices to bleed dry existing customers as much as they can, the issue is in the VM space, there are some big players, such as Microsoft and already existing open source projects such as ProxMox that is gaining tractions \\[3\\]\n\n\n\nBut This isn't what I want to talk about, and this isn't the reason for their latest rally, it's their semiconductor division, and the latest google TPU Meta deal.\n\n\n\nBroadcom has a gross margin of roughly 67% I am going to reasonably assume that they have a way higher margin on their software division compared to their chips division. I am going to assume a reasonable, yet very optimistic gross margin of 60% on their chip divisions, slightly higher than what Qualcom or Marvel gets, which designed and helped fab Amazon's AI chips. This leaves roughly 75% gross margin for their software division. I believe their software margins are way higher, and their chip divisions are lower but it doesn't matter.\n\n\n\nTheir operating margins are way lower, at 26%.\n\n\n\nSo on purely current revenue and profitability, I am going to compare to Nvidia's Q2 to make it fairer, since they have more than 2 months delay between their earnings.\n\n\n\nin Q2 Nvidia had a gross revenue of 45 B, or almost 3x (2.9x) Broadcom's Q3 revenue In Terms of Net Income Nvidia did 26.4B, which is even more drastic of a difference compared to Broadcom's 6.2x !\n\n\n\nSo this puts proportionally Broadcom at 40 % valuation of Nvidia, does 34 % Gross Revenue, But 16 % Net Revenue\n\n\n\nFor the sake of the argument, If Nvidia went full panic mode, and decreased their insane margins to undercut Broadcom, at 20% margins, Nvidia would still do 9B in revenue, which is more than 2x what Broadcom does now.\n\n\n\nNow in terms of the future, they helped design googles TPUs but google owns the IP. And in the openAI deal, openAI is to design and own the IP (And Microsoft will also have rights due to their arrangements, so Broadcom will be paid to help the design and in the manufacturing, but they aren't going further than this.\n\n\nEDIT 1 Growth:\n\nI wanted to add a section on growth,\n\nQ3 saw a 6 % growth overall from Q2 and a 22% YoY\nIn terms of the Chip division, it saw a roughly 9% increase from Q2\n\nTheir own projections for Q4 expect a 9 % growth from Q3\n\nThis is below both nvidia's and AMD Q/Q growth\n\nThis is why Broadcom only shows YoY growth and not Q/Q like AMD or Nvidia, to make their growth look better.\n\nBased on this, Broadcom would have to 6x their semiconductor revenue in 2026 to justify their current valuation, which does not reflect at all their current growth.\n\nCurrent projections include existing google TPU demand, so even if you double it to include say openAI demand, it is still not realistic to hit such levels.\n\nEDIT 2 Debt:\n\nBroadcom also has lots of debt, they took a bit of short term debt, a small increase from 2024 at 1.4 B\n\nBut they also have a 62 B long term debt\n\nEven if they are decreasing debt from 2024, they still have a an insane debt to revenue as well as equity ratio.\n\n\n\nBoth AMD and Nvidia have proportionally way less debt.\n\n1: [https://www.networkworld.com/article/3994107/vmware-customers-in-europe-face-up-to-1500-price-increases-under-broadcom-ownership.html](https://www.networkworld.com/article/3994107/vmware-customers-in-europe-face-up-to-1500-price-increases-under-broadcom-ownership.html)   \n  \n2: [https://www.forte-systems.com/blog/vmwares-price-revolution-how-broadcoms-changes-are-reshaping-mid-market-it-strategy](https://www.forte-systems.com/blog/vmwares-price-revolution-how-broadcoms-changes-are-reshaping-mid-market-it-strategy)\n\n\n\n3: [https://cybernews.com/security/vmware-users-flee-to-proxmox-but-forget-updates/](https://cybernews.com/security/vmware-users-flee-to-proxmox-but-forget-updates/)",
      "score": 67,
      "comments": 50,
      "created_utc": 1764196384.0,
      "author": "AppleTrees2",
      "url": "https://reddit.com/r/stocks/comments/1p7lnmz/broadcom_dd_highly_overvalued/",
      "flair": null,
      "upvote_ratio": 0.8,
      "credibility_score": 5.925000000000001,
      "ai_relevance_score": 0.5009750000000001
    },
    {
      "type": "trending_news",
      "subreddit": "economy",
      "title": "In 2025, payroll growth has slowed to less than half the pace of 2024. Hiring particularly fell off a cliff after ‘liberation day’.",
      "content": "In 2025, payroll growth has slowed to less than half the pace of 2024. Hiring particularly fell off a cliff after ‘liberation day’.",
      "score": 41,
      "comments": 7,
      "created_utc": 1764198082.0,
      "author": "Conscious-Quarter423",
      "url": "https://reddit.com/r/economy/comments/1p7mbz5/in_2025_payroll_growth_has_slowed_to_less_than/",
      "flair": null,
      "upvote_ratio": 0.89,
      "credibility_score": 7.949999999999999,
      "ai_relevance_score": 0.50025
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "Deere Outlook Falls Short as Farm Rebound Remains Elusive",
      "content": "Deere Outlook Falls Short as Farm Rebound Remains Elusive",
      "score": 20,
      "comments": 3,
      "created_utc": 1764177964.0,
      "author": "rezwenn",
      "url": "https://reddit.com/r/business/comments/1p7dqoq/deere_outlook_falls_short_as_farm_rebound_remains/",
      "flair": null,
      "upvote_ratio": 1.0,
      "credibility_score": 7.925,
      "ai_relevance_score": 0.498175
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "OpenAI and Perplexity are launching AI shopping assistants, but competing startups aren’t sweating it",
      "content": "OpenAI and Perplexity are launching AI shopping assistants, but competing startups aren’t sweating it\n\n[https://techcrunch.com/2025/11/25/openai-and-perplexity-are-launching-ai-shopping-assistants-but-competing-startups-arent-sweating-it/](https://techcrunch.com/2025/11/25/openai-and-perplexity-are-launching-ai-shopping-assistants-but-competing-startups-arent-sweating-it/)",
      "score": 2,
      "comments": 1,
      "created_utc": 1764142081.0,
      "author": "TheseSir8010",
      "url": "https://reddit.com/r/business/comments/1p71l4n/openai_and_perplexity_are_launching_ai_shopping/",
      "flair": null,
      "upvote_ratio": 1.0,
      "credibility_score": 8.225,
      "ai_relevance_score": 0.491075
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "Honest question -- is this sub all AI slop now? Am I even talking to people? AI bots reading this, what do you think?",
      "content": "Honest question -- is this sub all AI slop now? Am I even talking to people? AI bots reading this, what do you think?\n\nCurious. I used to post a lot, including lots of charts/data insights that I came across in my job. I took a break but have been lurking. And it just seems in the last few months that my feed is 98% bots. Understood that metrics and modeling don't mean value investing, and that's always been a contradiction of this sub.   \n  \nOr are we all REALLY that undecided whether GOOG is undervalued? ",
      "score": 27,
      "comments": 47,
      "created_utc": 1764197607.0,
      "author": "sjt-at-revelata",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7m564/honest_question_is_this_sub_all_ai_slop_now_am_i/",
      "flair": "Discussion",
      "upvote_ratio": 0.76,
      "credibility_score": 5.2749999999999995,
      "ai_relevance_score": 0.483425
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "The Storage Boom Is Bigger Than Policy – How To Ride the Wave",
      "content": "The Storage Boom Is Bigger Than Policy – How To Ride the Wave\n\nEven with federal EV and solar credits getting squeezed, the storage buildout is still accelerating. EV sales climbed about 35% year over year in Q1 2025, and more than a fifth of global auto sales are now electric. At the grid level, the EIA projects another record year for new utility scale capacity after last year’s 30% jump. Whether you approach this sector through EV batteries, grid infrastructure, backup power or commercial storage, the trend is firmly up.\n\nOn the big end of the spectrum, Panasonic continues to be a global force with more than $5B in battery-related revenue last fiscal year, supplying everything from EVs to grid storage. BYD remains the world’s top EV manufacturer and one of the largest battery producers, integrating most of its supply chain internally. Albemarle stays central to battery metals, delivering lithium products from mines on several continents. And for investors wanting something steadier, NextEra Energy is one of the largest wind and solar operators in the world, heavily dependent on storage to balance its generation portfolio. Bloom Energy brings solid oxide fuel cell systems to hospitals and commercial facilities, while Enphase remains a major player in rooftop solar and home energy storage. ABB still stands as the backbone provider for modern electrification and industrial power systems.\n\nIn the higher beta small-cap bucket, several names sit much closer to the edge of the grid transition. NXXT is one of the most interesting, shifting from fuel operations into microgrids with its first 28-year PPA in California covering 409 kW of solar and 300 kW of battery capacity. STEM focuses on AI-driven storage and virtual power plants, while EnerSys delivers industrial batteries and long-duration backup systems for critical sites. Fluence operates large-scale battery and control platforms across global grids. These companies do not move like utilities – each project can materially change their trajectory.\n\nThe large caps define where the sector is headed. The smaller ones feel each shift more intensely. Not financial advice.",
      "score": 26,
      "comments": 12,
      "created_utc": 1764180224.0,
      "author": "PopcornMarshal",
      "url": "https://reddit.com/r/investing/comments/1p7erbe/the_storage_boom_is_bigger_than_policy_how_to/",
      "flair": null,
      "upvote_ratio": 0.88,
      "credibility_score": 7.625,
      "ai_relevance_score": 0.48287500000000005
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "Apple set to become world’s top phone maker, overtaking Samsung",
      "content": "Apple set to become world’s top phone maker, overtaking Samsung",
      "score": 3,
      "comments": 1,
      "created_utc": 1764149190.0,
      "author": "Redd24_7",
      "url": "https://reddit.com/r/business/comments/1p73epy/apple_set_to_become_worlds_top_phone_maker/",
      "flair": null,
      "upvote_ratio": 1.0,
      "credibility_score": 7.925,
      "ai_relevance_score": 0.481375
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "Isn’t everything expensive..",
      "content": "Isn’t everything expensive..\n\nDoesn’t shiller pe seem crazy high. It’s hard finding cheap stocks. Yah you can screen on ROIC. But if market drops 20-40% nothing will be spared ",
      "score": 12,
      "comments": 76,
      "created_utc": 1764204216.0,
      "author": "arbitragedude",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7ok5g/isnt_everything_expensive/",
      "flair": "Question / Help",
      "upvote_ratio": 0.69,
      "credibility_score": 4.5,
      "ai_relevance_score": 0.47669999999999996
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "Warner Music Group settles lawsuit with AI music firm and launches joint venture",
      "content": "Warner Music Group settles lawsuit with AI music firm and launches joint venture",
      "score": 18,
      "comments": 6,
      "created_utc": 1764160277.0,
      "author": "GrayBeard916",
      "url": "https://reddit.com/r/business/comments/1p76j52/warner_music_group_settles_lawsuit_with_ai_music/",
      "flair": null,
      "upvote_ratio": 0.87,
      "credibility_score": 7.6,
      "ai_relevance_score": 0.46399999999999997
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "CUDA and Google Tensor: Question",
      "content": "CUDA and Google Tensor: Question\n\nGoogle Tensor has broke through Nvidia's almost monopolistic position on AI story and chips.\n\nBut I am wondering and asking if someone with more knowledge can explain to me if Google Tensor can supplement or replace nvidia chips.\n\nThe major reason why AMD could not directly compete with Nvidia was that CUDA was created by Nvidia decades ago and all AI developers use CUDA and its library. Even though AMD hardware can compete with Nvidia hardware, CUDA not officially supporting AMD chips made it undesirable for the industry. AMD tried to help it with unofficial support of CUDA as their own solution is not widely adopted.\n\nAfaik Google Tensor cannot use CUDA officially either. Is this a problem for Tensor and for AI devs?",
      "score": 45,
      "comments": 24,
      "created_utc": 1764174358.0,
      "author": "Suibeam",
      "url": "https://reddit.com/r/investing/comments/1p7c4km/cuda_and_google_tensor_question/",
      "flair": null,
      "upvote_ratio": 0.87,
      "credibility_score": 6.1,
      "ai_relevance_score": 0.4619
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "Are bond vigilantes extinct?",
      "content": "Are bond vigilantes extinct?\n\nIn the 1980s &amp; 90s, bond investors would dump U.S. treasuries to protest what they perceived as overly-generous government spending or artificially low interest rates from the Federal Reserve.\n\nBut today, they’re nowhere to be found. The 10-year treasury yield, which historically tended to track *nominal* U.S. GDP growth (currently at a ~5% annualized rate YTD, from ~2% real growth + ~3% inflation), is currently only ~3.9%. Inflation has been stuck at ~3% or higher for 5 years.\n\nInstead, today’s bond investors have an asymmetric reaction function in which any piece of negative economic news they could cling to causes yields to plunge (including soft data like consumer sentiment surveys, or private-sector reports like ADP &amp; ISM), while it takes a lot of sustained good news to push yields slightly higher.\n\nThe $4 trillion One Big Bill price tag, $38 trillion national debt, and now politically-compromised Federal Reserve haven’t caused Treasury investors to blink. Yields have continued to fall.\n\nI think central bank Q.E. changed everything. Bond investors enjoyed outsized returns in 2008 &amp; 2020 as central banks drove bond prices far above fair market value. It’s understandable they’re always trying to time the next windfall. Today, even with a 4% cushion in the federal funds rate to combat future recessions, Federal Reserve officials have not sworn off future usage of Q.E. Wall Street loves Q.E.\n\nAre treasury prices in a permanently high plateau? It should be noted that even with 2022’s “taper tantrum” &amp; inflation shock, yields are only back to where they were in 2007 and lower than the entire half-century preceding the financial crisis.",
      "score": 16,
      "comments": 3,
      "created_utc": 1764201023.0,
      "author": "MarkusEF",
      "url": "https://reddit.com/r/investing/comments/1p7nfb6/are_bond_vigilantes_extinct/",
      "flair": null,
      "upvote_ratio": 0.91,
      "credibility_score": 7.4,
      "ai_relevance_score": 0.4586
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "The Real AI CapEx Problem No One Wants to Talk About — And Why AMZN Might Be the Only Undervalued Hyperscaler Right Now",
      "content": "The Real AI CapEx Problem No One Wants to Talk About — And Why AMZN Might Be the Only Undervalued Hyperscaler Right Now\n\nA lot of people are cheering the AI boom, but there’s a growing concern that’s starting to hit investors: the ROI on all this AI CapEx is looking rough. Big Tech is dumping insane amounts of money into GPUs, data centers, power buildouts, and specialized chips, but very few of them have a clear path to actually making that money back anytime soon.\n\nMeta is spending to “improve engagement.” Google is spending to “defend search.” Apple is spending because everyone else is. Even Microsoft, despite having OpenAI, is still basically betting that enterprise AI adoption will ramp fast enough to justify the burn. But so far, outside of a few AI copilots and a ton of marketing, the revenue curve hasn’t caught up to the spending curve. The payback period for most of these companies is long and murky - at best.\n\nBut Amazon is a different story, and I don’t think the market is fully pricing this in.\n\nAmazon’s AI CapEx actually has immediate ROI because AWS can sell AI compute directly to customers who need it right now. Startups, enterprises, model labs, research orgs—everyone building or training anything AI-related needs compute, and AWS is still one of the default places they go. Unlike other hyperscalers, Amazon doesn’t need some blockbuster consumer-facing AI product; they just need more people needing more compute, which is already happening.\n\nAnd while Microsoft has a huge advantage with the OpenAI pipeline, Amazon’s advantage is that they’re not tied to a single model ecosystem. They’ll sell Nvidia GPUs, AMD MI300s, their own Trainium/Inferentia, and offer multiple model providers through Bedrock. They’re basically the AI hardware store. If you want to train or deploy something and don’t want to be locked into Azure, you go to AWS. That creates actual, tangible revenue today, not hypothetical future upside.\n\nThe important part here is that Amazon’s CapEx isn’t speculative. It’s demand-driven. They’re scaling out because customers are already paying for the capacity. Most of the other tech giants are scaling out because they hope the demand will show up later.\n\nAnd somehow, Amazon is still trading at valuations that don’t fully reflect this. If investors start shifting away from “AI vibes” and start caring more about who’s actually generating cash flows from AI, AMZN looks like a pretty obvious underpriced winner.\n\nNot financial advice, just what I’m seeing watching billions get spent with very different levels of payoff.",
      "score": 17,
      "comments": 28,
      "created_utc": 1764212763.0,
      "author": "Mattitudando",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7rdtn/the_real_ai_capex_problem_no_one_wants_to_talk/",
      "flair": "Discussion",
      "upvote_ratio": 0.78,
      "credibility_score": 5.325,
      "ai_relevance_score": 0.450775
    },
    {
      "type": "trending_news",
      "subreddit": "StockMarket",
      "title": "Huawei's Ascend AI chip ecosystem scales up as China pushes for semiconductor independence, however firm lags on efficiency and performance",
      "content": "Huawei's Ascend AI chip ecosystem scales up as China pushes for semiconductor independence, however firm lags on efficiency and performance",
      "score": 29,
      "comments": 0,
      "created_utc": 1764176005.0,
      "author": "Burnned_User",
      "url": "https://reddit.com/r/StockMarket/comments/1p7cuss/huaweis_ascend_ai_chip_ecosystem_scales_up_as/",
      "flair": "News",
      "upvote_ratio": 0.94,
      "credibility_score": 4.357,
      "ai_relevance_score": 0.413695
    },
    {
      "type": "trending_news",
      "subreddit": "ValueInvesting",
      "title": "Anyone betting against the AI giants",
      "content": "Anyone betting against the AI giants\n\nI’m wondering if anyone is betting the big AI company stocks will crash? \n\n",
      "score": 6,
      "comments": 33,
      "created_utc": 1764205247.0,
      "author": "Finnestad",
      "url": "https://reddit.com/r/ValueInvesting/comments/1p7owyu/anyone_betting_against_the_ai_giants/",
      "flair": "Discussion",
      "upvote_ratio": 0.69,
      "credibility_score": 4.5,
      "ai_relevance_score": 0.40309999999999996
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "Advantages of Fidelity vs Schwab vs Vanguard vs Merrill?",
      "content": "Advantages of Fidelity vs Schwab vs Vanguard vs Merrill?\n\nI'm torn between all of these.\n\nI hear that only Fidelity has no closure fee on the IRA and I also like the idea of using a cash management account as a high yield checking account.\n\nI like the credit card benefits on Merrill.\n\nI hear good things about think or swim from Schwab, although I don't really day trade.\n\nI don't hear much about Vanguard, just that it's outdated but they have the best robo advisors.\n\nI don't know much about the others and what they offer.",
      "score": 3,
      "comments": 37,
      "created_utc": 1764207263.0,
      "author": "Pacifian_Seaman",
      "url": "https://reddit.com/r/investing/comments/1p7plke/advantages_of_fidelity_vs_schwab_vs_vanguard_vs/",
      "flair": null,
      "upvote_ratio": 0.6,
      "credibility_score": 4.525,
      "ai_relevance_score": 0.33997499999999997
    },
    {
      "type": "trending_news",
      "subreddit": "business",
      "title": "Looking for medical instruments buyers",
      "content": "Looking for medical instruments buyers\n\nHello. I’m thinking of establishing a B2B/B2C relationship with people interested in buying surgical and medical instruments. \nIf this interests you, send a dm and we will work our stuff out.",
      "score": 2,
      "comments": 0,
      "created_utc": 1764174444.0,
      "author": "Adorable_Room6823",
      "url": "https://reddit.com/r/business/comments/1p7c5wp/looking_for_medical_instruments_buyers/",
      "flair": null,
      "upvote_ratio": 1.0,
      "credibility_score": 3.641,
      "ai_relevance_score": 0.32903499999999997
    },
    {
      "type": "trending_news",
      "subreddit": "SecurityAnalysis",
      "title": "GEICO: a Buffett investing masterclass",
      "content": "GEICO: a Buffett investing masterclass\n\n**What’s the best way to learn how to invest?**\n\nWarren Buffett and Charlie Munger have both said that if they were to teach an investing class, it would be built around *case studies*. Studying past cases helps you avoid mistakes others have made and recognize great opportunities when they appear again.\n\nToday, let’s walk through a fascinating case study: Warren Buffett’s early investment in **GEICO**, one of the most profitable investments in his career.\n\nThis is a classic example of buying a high-quality business with a durable competitive advantage and strong growth potential at a cheap price during an industry downturn.\n\n**Why GEICO was such a good business?**\n\nGEICO stands for *Government Employees Insurance Company*. In its early days, it sold auto insurance directly to government employees.\n\nThis was already a great customer segment: auto insurance is a necessity, and government employees generally have stable incomes.\n\nBut GEICO’s real edge came from its **direct-to-consumer model**. Instead of using independent insurance agents, who typically take commissions, GEICO relied on salaried staff, mail, and telephone marketing. This allowed GEICO to operate at a much lower cost and offer customers discounts of up to **30%** versus traditional insurers.\n\n**Why competitors couldn’t copy GEICO?**\n\nYou might wonder: *If it’s so effective, why didn’t other insurers imitate this model?*\n\nThe answer: **channel conflict**.\n\nMost insurers relied heavily on their commissioned agents for business. Switching to a direct model would mean disrupting their entire distribution channel and upsetting their agents in the short term. So even though GEICO’s model was better, incumbents were locked in.\n\nThe results speak for themselves: in 1949, GEICO’s underwriting profit-to-premium ratio was 27.5%, compared with an industry average of just 6.7%.\n\n**Incredible growth**\n\nGEICO also had a remarkable growth record. Premiums increased from just **$103,696** in 1936 to **$8,016,976** in 1950, an almost **80x expansion** in 14 years.\n\nAnd Buffett understood that the runway was still long.\n\nIn 1951, GEICO was licensed in only **15 out of 50 U.S. jurisdictions** and targeted mainly government employees. Expanding geographically and beyond government workers meant plenty of room left to grow.\n\n**A cheap valuation in disguise**\n\nDespite its competitive advantages and growth, GEICO traded at only **8x 1950 earnings**.\n\nWhy so cheap?\n\nBecause the industry was under pressure. From 1945 to 1951, many auto insurers suffered large losses. Repair costs surged faster than insurers could raise rates, creating an industry-wide earnings drag.\n\nBut GEICO remained profitable. In the first half of 1951, it continued to earn a profit while its competitors suffered losses:\n\n* GEICO’s net profit margin: **9%**\n* Massachusetts Bonding &amp; Insurance: **-16%**\n* New Amsterdam Casualty: **-8%**\n\nBuffett recognized that this was temporary, and insurance rates would eventually catch up with claims costs.\n\n**What happened next?**\n\nAfter Buffett published his analysis in 1951, GEICO’s stock rose about 30%. He later sold to pursue even cheaper opportunities but eventually bought back shares at other points.\n\nHis mentor Benjamin Graham, however, held the stock from 1948 into the early 1970s and earned an extraordinary **562x return**.\n\n**Key lesson**\n\nThis case study shows how much money can be made by buying **great companies with durable competitive advantages, long growth runways, and temporarily depressed valuations**.\n\nSome say opportunities like GEICO don’t exist today because markets are more efficient.\n\nAs always, I respectfully disagree.\n\nThere are always mispriced great businesses. Finding them just requires hard work, discipline, and learning from history. That’s why studying case studies remains one of the best ways to become a better investor.\n\nPreviously, I wrote about a company trading at around 7x EV/Earnings with a profile similar to GEICO, a misunderstood business that outcompetes its rivals by offering low prices and has tremendous growth potential. You can read more about this stock in my Substack post.\n\nDISCLAIMER: The content shared here is for informational purposes only and should not be considered tax, legal, or financial advice. I may hold positions in some of the securities mentioned and may buy or sell them at any time without notice. While I strive for accuracy, errors or omissions may occur, and my views may change over time. I am not acting as your fiduciary.",
      "score": 12,
      "comments": 0,
      "created_utc": 1764136370.0,
      "author": "tperie",
      "url": "https://reddit.com/r/SecurityAnalysis/comments/1p6zyvh/geico_a_buffett_investing_masterclass/",
      "flair": "Discussion",
      "upvote_ratio": 0.78,
      "credibility_score": 3.221,
      "ai_relevance_score": 0.328335
    },
    {
      "type": "trending_news",
      "subreddit": "investing",
      "title": "What do you think will happen when the economic data finally does see the light of day?",
      "content": "What do you think will happen when the economic data finally does see the light of day?\n\nFor those uninformed, the Bureau of Economic Analysis has canceled their release of the Q3 advanced estimate on GDP along with not releasing the jobs report for October.\n\nWith the sweeping tarrifs, high inflation and mass deportations all playing major rolls in GDP, these numbers can't be good. So my main concern is when these numbers finally do release do we expect a significant market downturn?\n\nI've personally debated pulling all my money out for the first time in my life with nearly half the states currently in a recession and many more soon to join. The market rebounded this week, but this feel likes a bandaid on a bullet hole to keep things temporarily afloat. Thoughts?",
      "score": 7,
      "comments": 25,
      "created_utc": 1764208760.0,
      "author": "LOP5131",
      "url": "https://reddit.com/r/investing/comments/1p7q2yg/what_do_you_think_will_happen_when_the_economic/",
      "flair": null,
      "upvote_ratio": 0.59,
      "credibility_score": 4.5,
      "ai_relevance_score": 0.3211
    }
  ],
  "summary": {
    "total_posts_collected": 70,
    "average_score": 396.34285714285716,
    "average_comments": 115.92857142857143,
    "top_subreddits": {
      "StockMarket": 7,
      "economics": 7,
      "CryptoCurrency": 7,
      "Superstonk": 7,
      "wallstreetbets": 7,
      "investing": 7,
      "economy": 7,
      "stocks": 7,
      "business": 6,
      "ValueInvesting": 7,
      "SecurityAnalysis": 1
    },
    "collection_timestamp": "2025-11-26T20:50:36.618363"
  },
  "total_posts": 70,
  "timestamp": "2025-11-26 20:49:35"
}